{
  "Spells": ["Adhere: Object is covered in extremely sticky slime.",
    "Animate Object: Object obeys your commands as best it can. It can walk 15ft per round.",
    "Anthropomorphize: A touched animal either gains human intelligence or human appearance for L days.",
    "Arcane Eye: You can see through a magical floating eyeball that flies around at your command.",
    "Astral Prison: An object is frozen in time and space within an invulnerable crystal shell.",
    "Attract: L+1 objects are strongly magnetically attracted to each other if they come within 10 feet.",
    "Auditory Illusion: You create illusory sounds that seem to come from the direction of your choice.",
    "Babble: A target must loudly and clearly repeat everything you think. It is otherwise mute.",
    "Change Form: You and your possessions transform into ancreature.",
    "Befuddle: L targets of your choice are unable to form new short-term memories for the duration of the spell.",
    "Bend Fate: Roll L+1 d20s. Whenever you must roll a d20 after casting the spell, you must choose and then discard one of the rolled results until they are all gone.",
    "Winged: Your arms turn into adjective wings.",
    "Body Swap: You switch bodies with the target you touch. If one body dies, the other dies as well.",
    "Charm: L beings treat you like a friend.",
    "Command: A creature obeys a single, three-word command that does not harm it.",
    "Comprehend: You become fluent in all languages.",
    "Control Plants: Nearby plants and trees obey you and gain the ability to move at 5 feet per round.",
    "Control Weather: You may alter the type of weather at will, but you do not otherwise control it.",
    "Counterspell: Make an opposed Intelligence save against the Intelligence of the caster of a nearby spell. You may do this out of turn as a reaction, or against an ongoing magical effect. On a success, you may cancel the spell.",
    "Deafen: All nearby targets are deafened.",
    "Detect Magic: You hear nearby magical auras singing. Volume and harmony signify the aura’s power and refinement.",
    "Disassemble: Any of your body parts may be detached and reattached at will, without causing pain or damage. You can still control them.",
    "Disguise: You may alter the appearance of L characters at will as long as they remain humanoid. Attempts to duplicate other characters will seem uncanny.",
    "Displace: An object appears to be up to L×10ft from its actual position.",
    "Earthquake: The ground begins shaking violently. Structures may be damaged or collapse.",
    "Elasticity: Your body can stretch up to L×10ft.",
    "Elemental Wall: A straight wall of ice or fire L×40ft long and 10ft high rises from the ground.",
    "Filch: L visible items teleport to your hands.",
    "Fog Cloud: anadjective fog spreads out from you.",
    "Frenzy: L targets erupt in a frenzy of violence.",
    "Gate: A portal to anadjective plane opens.",
    "Gravity Shift: You can change the direction of gravity (for yourself only) up to once per round. ",
    "Greed: L targets develop an overwhelming urge to possess a visible item of your choice.",
    "Haste: Your movement speed is tripled.",
    "Hatred: L targets develop a deep hatred of another creature or group of targets and wish to destroy it.",
    "Hear Whispers: You can hear faint sounds clearly.",
    "Hover: An object hovers, frictionless, 2ft above the ground. It can hold up to L humanoids.",
    "Hypnotize: A target enters a trance and will truthfully answer L yes or no questions you ask it. ",
    "Icy Touch: A thick ice layer spreads across a touched surface, up to L×10ft in radius.",
    "Illuminate: A floating, adjective light moves as you command.",
    "Increase Gravity: The gravity in an area triples.",
    "Invisible Tether: Two objects within 10ft of each other cannot be moved more than 10ft apart.",
    "Knock: L nearby mundane or magical locks unlock.",
    "Leap: You can jump up to L×10ft in the air.",
    "Liquid Air: The air around you becomes swimmable.",
    "Magic Dampener: All nearby magical effects have their effectiveness halved.",
    "Manse: A sturdy, adjective cottage appears for L×12 hours. You can permit and forbid entry to it at will. It contains adjective furniture.",
    "Marble Madness: Your pockets are full of marbles, and will refill every round.",
    "Masquerade: L characters’ appearances and voices become identical to a touched character.",
    "Miniaturize: You and L other touched targets are reduced to the size of a mouse.",
    "Mirror Image: L illusory duplicates of yourself appear under your control.",
    "Mirrorwalk: A mirror becomes a gateway to another mirror that you looked into today.",
    "Multiarm: You gain L extra arms.",
    "Night Sphere: An L×40ft wide sphere of darkness displaying the night sky appears.",
    "Objectify: You become any inanimate object between the size of a grand piano and an apple.",
    "Ooze Form: You become a living jelly.",
    "Pacify: L targets have an aversion to violence. ",
    "Phantom Coach: A ghostly coach appears until the end of the spell. It moves unnaturally fast over any terrain, including water.",
    "Phobia: L targets become terrified of an object of your choice.",
    "Pit: an adjective pit 10ft wide and L×5ft deep opens in the ground.",
    "Primeval Surge: An object grows to the size of an elephant. If it is an animal, it is enraged.",
    "Psychometry: The referee answers L yes or no questions about a touched object.",
    "Pull: An object of any size is pulled directly towards you with the strength of L men for one round.",
    "Push: An object of any size is pushed directly away from you with the strength of L men for one round.",
    "Raise Dead: L skeletons rise from the ground to serve you. They are incredibly stupid and can only obey simple orders.",
    "Raise Spirit: The spirit of a dead body manifests and will answer L questions.",
    "Read Mind: You can hear the surface thoughts of nearby targets.",
    "Repel: L+1 objects are strongly magnetically repelled from each other if they come within 10 feet.",
    "Scry: You can see through the eyes of a creature you touched earlier today.",
    "Sculpt Elements: All inanimate material behaves like clay in your hands.",
    "Shroud: L targets are invisible until they move.",
    "Shuffle: L targets instantly switch places. Determine where they end up randomly.",
    "Sleep: L targets fall into a light sleep.",
    "Smoke Form: Your body becomes living smoke.",
    "Beast Knight: 10 minutes after casting, a knight sitting astride a large creature rides into view. He is able to answer most questions related to quests and chivalry, and may aid you if he finds you worthy.",
    "Sniff: You can smell even the faintest traces of scents.",
    "Sort: Inanimate items sort themselves according to categories you set. The categories must be visually verifiable.",
    "Spectacle: A clearly unreal but impressive illusion of your choice appears, under your control. It may be up to the size of a palace and has full motion and sound. ",
    "Spellseize: Cast this as a reaction to another spell going off to make a temporary copy of it that you can cast at any time before this spell ends.",
    "Spider Climb: You can climb surfaces like a spider.",
    "Summon Cube: Once per second, (6 times per round) you may summon or banish a 3-foot-wide cube of earth. New cubes must be affixed to the earth or to other cubes.",
    "Swarm: You become a swarm of crows, rats, or piranhas. You only take damage from area effects.",
    "Telekinesis: You may mentally move L items.",
    "Telepathy: L+1 targets can hear each other’s thoughts, no matter how far apart they move.",
    "Teleport: An object disappears and reappears on the ground in a visible, clear area up to L×40ft away.",
    "Thaumaturgic Anchor: Object becomes the target of every spell cast near it. ",
    "Thicket: A thicket of trees and dense brush up to L×40ft wide suddenly sprouts up.",
    "Time Jump: An object disappears as it jumps L×10 minutes into the future. When it returns, it appears in the unoccupied area nearest to where it left.",
    "Summon Idol: A carved stone statue the size of a four-poster bed rises from the ground.",
    "Time Rush: Time in a 40ft bubble starts moving 10 times faster.",
    "Time Slow: Time in a 40ft bubble slows to 10%.",
    "True Sight: You see through all nearby illusions.",
    "Upwell: A spring of adjective seawater appears.",
    "Vision: You completely control what a target sees.",
    "Visual Illusion: A silent, immobile, illusion of your choice appears, up to the size of a tavern.",
    "Ward: A silver circle 40ft across appears on the ground. Choose one thing that cannot cross it: Living beings, dead things, projectiles or metal.",
    "Web: Your wrists can shoot thick webbing.",
    "Wizard Mark: Your finger can shoot a stream of COLOR Paint. This paint is only visible to you, and can be seen at any distance, even through solid objects.",
    "X-Ray Vision: You gain X-Ray vision.",
    "Aerolinguist: You can listen the wind. It does not hear you, but constantly jabbers on about the places it has been and what it has seen.",
    "Airlifting: The caster and L targets they are touching become weightless.",
    "Amber Arrow: Fire a large bolt of sticky honey that solidifies into amber on contact with an object.",
    "Aqualinguist: You can speak with water. Buckets are dim, rivers have personalities, etc.",
    "Blissful Silence: A magical silence fills an area the size of a tavern.",
    "Bright Companion: Summon a glowing, incorporeal creature that. Light as a lantern. It remembers you, and can be trained to follow simple commands.",
    "Bubble of Pestilence: Blow a small bubble of pure death. It floats around randomly and uncontrollably. If it touches a living target, that target must save or contract a deadly illness.",
    "Cloaked Flame: Summon a floating orb of bright, adjective light. All objects in its light are rendered invisible, but the light itself can be seen from far off.",
    "Compelling Crow: Summon a spectral crow and point to an object. The crow utters a single secret about that object.",
    "Conservation of State: Repair a broken object (fractured chain, torn fabric, etc) by breaking a similar object.",
    "Magical Fire: Conjur a single COLOR flame that can use any solid material as fuel. The flame never grows larger than that of a candle, and won't go out until it runs out of fuel.",
    "Dense Hiccups: The caster drinks a liquid and burps L large bubbles of that liquid. The bubbles are solid and won't pop for the next Lx10 minutes.",
    "False Stench: An object gives off any smell you can recall from memory.",
    "Flesh Map: Instead of sleeping, spend 8 hours casting this spell. A tattooed map of the surrounding L miles appear on your unmarked skin. The larger the map, the more skin is used up.",
    "Geolinguist: You can speak with earth and stone. Stone rarely notices anything aside from unique vibrations or movement. Their understanding of time is tenuous at best.",
    "Tempered Speech: You can speak to any Tempered Item. Weapons have a shifting personality made up their previous wielders and memories.",
    "Harmony: L willing targets perfectly synchronize their movements to yours.",
    "Replay: Perfectly recall and examine any memory as if you were reliving it. ",
    "Impromptu Steed: Grow any nearby non-sentient target to the size of a horse. As long as it is fed and cared for, it will bear you as a rider for L days.",
    "Spectral Chamber: Disappear an item into a dimensional pocket. When this spell ends, the item reappears in the same place.",
    "Memory Spike: Fire a quiet magical spike (damage as dagger). The target will not be aware of the attack for Lx10 seconds; they won't feel it, notice it, or remember it.",
    "Vaporize: Turn L barrels worth of liquid into a breathable gas. Turns back into a liquid when the spell ends.",
    "Mutual Mindwipe: The caster and target lose all memories (up to the past L days).",
    "Pyrolinguist: You can speak with fire. Fire is excitable, hungry, and forgetful.",
    "Sand Castle: Any loose material (dirt, snow, sand) can be formed into a structure the castor imagines. It dissolves with the next sunrise (even if the structure is underground).",
    "Spectral Arena: The caster and L targets are transported to a random plane. When only one survivor remains, they are transported back to their original location. To everyone else, only seconds have passed.",
    "Tempered Soul: Promise the soul of a target to a Tempered Weapon. When that target would die, it instead becomes a Slot in the Weapon (and replaces this slot). When that Slot is replaced or changed the target is brought back to life.",
    "Transfer Wounds: A target you touch takes on one of your wounds. The target may save to avoid.",
    "Goooooo: an object is covered in a thin layer of adjective goo."
  ],
  "Enchantments": [
    "Deadly Comradery. On your turn you can toss this weapon to an ally who immediately gets to make an attack with it. If they miss their attack, the weapon immediately returns to your hands.",
    "Every morning this weapon teleports to your hand; clean, sharp, and like new.",
    "If wielded in the off-hand, this weapon acts like a shield.",
    "The tip of the weapon is flammable. Once lit, the weapon can't be put out until the sun sets. Burns like a candle.",
    "Second Chance. The next time the wielder would die, instead remove this enchantment and return the wielder to 1 HP.",
    "The weapon emits a strong magnetic field.",
    "The weapon plays a song while held.",
    "The weapon drifts to point towards the last creature it injured.",
    "This weapon absorbs ambient light. When struck it releases it all in a bright flash.",
    "This weapon is lighter than air.",
    "This weapon can be used to block and absorb a spell. That spell is automatically cast when the weapon sheathed.",
    "This weapon can damage any creature or spirit older than the Wielder, but cannot injure anything younger.",
    "This weapon can only be held or moved by the Wielder. Otherwise it is incredibly heavy.",
    "This weapon can store up to 8 hours of wakefulness to be accessed later. Requires 8 extra hours of sleep to recharge.",
    "This weapon deals double damage to the first thing it strikes every day.",
    "This weapon deals more damage than usual, but cannot reduce an enemy below 1HP.",
    "This weapon has a hollow cavity, and can store up to 50lbs of gold and gems.",
    "This weapon slowly dissolves any material it comes in contact with, at the rate of a 1ft cube every hour.",
    "When a foe is killed with this weapon, the Wielder becomes sick and nauseous.",
    "When placed on the ground, the weapon will spin and point towards the closest danger.",
    "When thrown, this weapon returns to your hands if you miss your target.",
    "When you a threatened with a killing blow you may remove this enchantment to suffer no damage.",
    "When you let go of this weapon, it floats solidly in place.",
    "When you let go of this weapon it bursts into flames. Won't go out until it's picked back up.",
    "Where this weapon is planted into fertile ground, a full meal will grow in 24 hours. Doesn't include water.",
    "Wherever this weapon strikes soft earth it plants a magical seed. By the next day a 10ftx10ft clump of thorny shrubs has grown from the seed.",
    "While held, the weapon is completely invisible.",
    "While sheathed this weapon reduces the Wielder's weight by half.",
    "Whoever holds this weapon cannot lie.",
    "With a little concentration you can alter the shape and appearance of this weapon to anything of similar size.",
    "With a simple command this weapon will fight on its own. Lasts until it deals damage, at which point the weapon falls to the ground.",
    "You can swallow this weapon and draw it from your mouth. You cannot eat or drink while is it swallowed.",
    "You may block a spell with this weapon. Replace this enchantment with the spell you blocked.",
    "You may sacrifice resources or health to manifest ammunition for this weapon.",
    "This weapon contains a hidden, detachable throwing knife in the grip. If the knife is missing for 3 days the weapon summons a new one to replace it.",
    "The engravings constantly shift to produce a vague map of the area.",
    "While you hold this weapon, it regulates your body temperature and keeps you comfortable in extreme environments.",
    "The grip is made of absorbent bandages. The bandages replenish every morning.",
    "The tip of the weapon constantly drips enough water to keep someone alive but miserable.",
    "This weapon can be instantly changed to another form by special command. This command may only be uttered once a day.",
    "While drawn this weapon is wreathed in flames.",
    "While drawn this weapon is covered in black ice.",
    "While drawn this weapon crackles with electricity.",
    "A few seconds after the weapon is embedded into an enemy or surface, a bolt of lightning strikes it."
  ],
  "Mutations": ["2d10 large barnacles grow on your body. They feed on smoke, dust, and pollen.",
    "Agreeable. You must always verbally agree to any request. You don’t actually have to do it.",
    "An unseen voice describes any mundane object you pick up. “Sword”, “Brick”, etc.",
    "Bird Friend. Sparrows and small birds bring you worms and expect you to be impressed.",
    "Bloodthirsty. You are only satisfied by eating live creatures.",
    "Cold-blooded. You cannot regulate your own body temperature. Cold temperatures slow down your body.",
    "Contagious yawn. Whenever you yawn every creature that can see you must save or yawn.",
    "Cyclops. All of your eyes migrate to the center of your face and fuse into one large eye.",
    "Finger Mouths. Every finger ends in a tiny lamprey mouth. Can use them to eat or drink.",
    "Gain vestigial bird wings. They are too weak to bear your weight.",
    "Grow thick white fur on every inch of skin. Resistant to cold weather. Vulnerable to hot environments.",
    "Hair Migration. All of your hair migrates to the top of your head in a huge tuft.",
    "Important life events blossom into full colour tattoos.",
    "Lantern Jaw. Enormous underbite. When mouth is open, casts light as a lantern.",
    "Liar’s Nose. Glows like a candle when you tell a lie.",
    "Lightning Finger. One finger glows blue and sizzles. Can poke someone for 1 lightning damage.",
    "Mad Dreams. When woken, you scream as loudly as you can for 1 minute.",
    "Once per day, you must vomit up a 2” diameter stone ball.",
    "One eye can see souls. It is grey, milky, swirls like a stormcloud.",
    "One finger becomes solid gold. Does not bend. Worth 10gp.",
    "One hand morphs into a sharp point of bone. Counts as a dagger.",
    "Skin Buttons. You can unbutton your chest and open up the skin flaps. Makes surgery easy.",
    "Spider Gland. Can excrete 10’ of sticky rope per day.",
    "Terror Blood. Deep cuts emit smoke, sparks, and screams.",
    "Thunder Guts. After a meal, you make a noise like a thunderstorm for 10 minutes.",
    "Two fuzzy antlers grow from your head. Damage as daggers.",
    "Two of your legs end in hooves. Can’t wear shoes, require horseshoes.",
    "Whenever you step, faint indigo sparks mark your footprints.",
    "While asleep or unconscious, you appear to be a corpse.",
    "While asleep or unconscious, your weight increases by 500lbs.",
    "Yarn Body. You are crochet. Button eyes, yarn teeth. Can be painfully unraveled.",
    "You always reek of burnt hair and charred meat.",
    "You become completely mute, but your enchanted eyebrows can communicate almost as well.",
    "You can bounce off an invisible plate of force mid-leap. Double jump distance.",
    "You cannot live longer than 100 years. If you are already over 100 years old, you perish immediately.",
    "You cannot swim. You sink in water as if it was air.",
    "You develop a disturbing hole right through the middle of your forehead.",
    "You exhale wisps of fragrant, colored smoke.",
    "You grow bat wings. Fly speed equal to your movement speed.",
    "You have every appearance of being a vampire, but are not one.",
    "You have magnetic hands. Most metals stick to them.",
    "You have spike teeth. Long and serrated. If damaged, new teeth regrow in 1 week.",
    "Your blood is always at a boiling temperature.",
    "Your blood is infused with a terrible wind. Deep cuts emit a whistling scream.",
    "Your digestive system withers, and you rely on photosynthesis for your energy. 2 hours of sunlight counts as a meal.",
    "Your eyes are actually sapphires. They work as normal.",
    "Your eyes become glowing balls of flame. They glow like candles.",
    "Your hair becomes vibrant green moss.",
    "Your hair turns to metal. The thin wires grow heavier and heavier every day.",
    "Your hands are very adhesive. Can climb anything a spider could climb.",
    "Your hide is thick and leathery. Always count as wearing leather armour.",
    "Your mouth is constantly salivating, leaving a trail of slime down your front.",
    "Your neck lengthens and can rotate 360 degrees.",
    "Your nose becomes a long spike. Can be thrown like a dagger. Re-grows after a week.",
    "Your organs are cursed. When you suffer a deep cut, you must make a Save to keep them from wriggling free.",
    "Your skin becomes covered in unfamiliar star constellation patterns that glow at night.",
    "Your skin becomes soluble, and will dissolve in heavy rain.",
    "Your tongue becomes a long butterfly-like proboscis. Can drink liquids up to 2’ away. Speaking is difficult.",
    "Something has gone wrong with your vocal cords. You sound like a distressed cat.",
    "You grow a large red neck pouch that you can inflate at will.",
    "You grow pale boils on your neck. If danger approaches, they glow green.",
    "One leg grows strong and thick. The other withers. Halve movement.",
    "You lay strange green eggs once a week. Eggs are probably unfertilized. Taste delicious.",
    "Your nose flies off as if fired from a cannon. Only returns when cured.",
    "All your knees and elbows now bend the other way.",
    "Age 2d10 years.",
    "You bleed black tar.",
    "Your blood becomes toxic. Immune to poison and diseases. Blood deals 1d4 damage.",
    "Your feet lengthen and become webbed. Half movement on land, double movement in water.",
    "Your skin becomes brittle and clear like glass.",
    "A small plant grows from your back. Does nothing. Leaves get in your eyes sometimes.",
    "Your mouth is replaced with a sharp beak. Speech becomes difficult.",
    "Your skin is always the colour of the sky overhead.",
    "Your legs gain a metallic sheen. They are immune to magic damage.",
    "One of your hands gains a mind of its own, and is actively trying to kill you.",
    "Your skin gains a tough, rubbery, orange texture. Immune to acid damage.",
    "Your tongue becomes long and prehensile. It can stretch up to 10 ft and is as strong as a rope.",
    "Your hands glow purple. Over the next year the glow spreads over your entire body. When every inch of skin has changed, you perish.",
    "Your mouth and nose seal up and you must breathe through your skin. The more clothing you wear, the harder it is to breathe.",
    "Your blood is highly flammable.",
    "Your hair growth speeds up dramatically. If not cut twice a day you might strangle yourself.",
    "Your body gains an eerie stillness; while sleeping you appear to be dead, and you can remain motionless indefinitely.",
    "You can only remember events from the past year. Any memory older than a year fades away.",
    "Your heartbeat is very slow and can be heard from several feet away.",
    "Your fingers secrete a bright yellow grease that stains everything you touch.",
    "From now on you age backwards, getting younger and younger until you perish as a fetus.",
    "A garishly colored hat appears on your head. It cannot be removed or replaced.",
    "Every morning you forget a word of your language. In a few years you can barely communicate.",
    "In moonlight, appear as a rotting corpse.",
    "Your mouth moves out of sync with your speech, as if speaking a different language.",
    "When healing from an injury, the new skin is reptilian.",
    "At any time, you can spit out an orange-red butterfly. It has no nutritional value.",
    "Spend the first hour of every day completely immobilized; you cannot move or take any action but you are aware of your surroundings.",
    "Whenever you close your eyes you instead see into another dimension. You need an extra 2 hours of sleep every day just to cope.",
    "You constantly hear loud music no one else can hear. Any sound lower than a yell is inaudible.",
    "You are overcome with a compulsion to draw. Save or spend the first 2 hours of every day scratching bizarre shapes in the dirt/stone/etc.",
    "An alien ritual consumes your thoughts. If you do not perform the 2-hour ritual once a day, you will go mad.",
    "Every day your voice sounds like that of a different person."
  ],
  "Knowledge": ["Athletics and Acrobatics",
 "Stealth and Sleight of Hand",
 "Arcana and History",
 "Investigation and Research",
 "Woodcraft and Animal Handling",
 "Religion, Cosmology, and Cosmetology",
 "Medicine and Alchemy",
 "Deception and Performance",
 "Intimidation and Persuasion",
 "Leadership and Battlefield Tactics",
 "Construction and Carpentry",
 "Complex Heists and Thievery",
 "Crafting and Smithing",
 "Blackmail on a prominent figure",
 "2 languages of your choice",
 "Tracking and Hunting exotic creatures",
 "Farming, fishing, and commonfolk activities",
 "Forbidden Magic",
 "Foreign Diplomacy and Customs",
 "Gambling and Cheating",
 "Herbalism an Woodcraft",
 "Marketing and Business",
 "Poisons and Potions",
 "Navigation and Seamanship",
 "Storytelling, Songs, Ballads",
 "The location of a great treasure",
 "The weakness of a terrible creature",
 "Passphrases and details of a powerful secret organization",
 "Mannerisms and Rituals of the Uppper Class",
 "The location of a rare and valuable plant",
 "You can curve your shots, hitting targets no one else could.",
 "Dancing, Singing, and entertaining a crowd",
 "You can pack your bags very efficiently, effectively carrying 20% more",
 "You always find something useful on fallen foes",
 "If you have the time, you can always recover your loose ammunition",
 "Your keen investigative skills allow you to determine what caused the death of a creature"],
  "Names": ["Takumi", "Cyriacus", "Melis", "Ali", "Triana", "Sunnifa", "Ruska", "Corraidhín", "Iida", "Simran", "Fleur", "Žydrūnas", "Nizhoni", "Annisa", "Rothaid", "Roland", "Faustino", "Sandhya", "Þýri", "Brian", "Natalina", "Chavaqquq", "Pran", "Kamil", "Giampaolo", "Geronimo", "Ricard", "Manisha", "Akhenaten", "Swanhild", "Jean-Michel", "Okonkwo", "Maruša", "Kunigunde", "Inaya", "Kurt", "Mus'Ad", "Fiore", "Gülnar", "Chandra", "Miklavž", "Dzvezda", "Devdas", "Jae", "Şukri", "Pierre", "Derryl", "Ronda", "Nausicaa", "Irakliy", "Nixon", "Jozefina", "Daphne", "Kostya", "Hakim", "Rustam", "Priidik", "Lya", "Abigaíl", "Maret", "Irma", "Eoforwine", "Gillis", "Rachana", "Ranulph", "Wigmund", "Monta", "Irene", "Kiarra", "Vera", "Anil", "Ane", "Teodosija", "Maia", "Kynaston", "Bailey", "Fritjof", "Alanis", "Maria", "Seyyed", "Magni", "Mai", "Baldo", "Alexandrine", "Ravza", "Hammurabi", "Perun", "Conrado", "Ysolt", "Ksenija", "Morteza", "Levente", "Greet", "Roslyn", "Annalee", "Kresten", "Luzia", "Dim", "Ira", "Lash", "Vague", "Flem", "Ail", "Toxen", "Koff", "Dewy", "Misty", "Sopp", "Drip", "Graydon", "Agatha", "Eldon", "Fossil", "Richter", "Pearl", "Gilden", "Millia", "Poba", "Sully", "Scrub", "Tatter", "Hugo", "Larga", "Jumbo", "Mondo", "Runt", "Teena", "Pinta", "Wheetle", "Zip", "Shyan", "Fidget", "Jitter", "August", "Narsis", "Braggen", "Trumpet", "Sharp", "Brainy", "Keen", "Canny", "Tax", "Vex", "Curie", "Meddle", "Boyle", "Shrieka", "Tirade", "Vement", "Stammer", "Chichi", "Bungle", "Sputter", "Slick", "Allure", "Glib", "Dear", "Frank", "Cathy", "Candid", "Gab", "Lance", "Scout", "Rant", "Grunt", "Cash", "Merelda", "Wage", "Monet", "Mac", "Ginny", "Swallow", "Swig", "Richard", "Patricia", "Lofty", "Gilden", "Mark", "Ruby", "Spot", "Trace", "Buzz", "Tattle", "Sland", "Prate", "Doc", "Kit", "Kwak", "Bones", "Bane", "Malvara", "Malek", "Nafeera", "Skip", "Lady", "Chevron", "Doyan", "Hunter", "Veil", "Slayton", "Drak", "Matt", "Allie", "Buddy", "Crony", "Champ", "Hera", "Diana", "Perseus", "Wulf", "Oracle", "Evoka", "Ovate", "Rob", "Frisk", "Crook", "Klept", "Astro", "Marge", "Auger", "Sear", "Shep", "Vicka", "Vine", "Lama", "Crimman", "Ribett", "Evaliam", "Luxuric", "Gelottle", "Curaeless", "Robidistub", "Magart", "Inclottes", "Immeding", "Walgente", "Beartinguer", "Specied", "Robiller", "Scally", "Denverecuth", "Gouces", "Scover", "Semister", "Aphronal", "Pacillusly", "Feassonak", "Newylity", "Locary", "Autighter", "Alingf", "Gianda", "Skilesty", "Consiters", "Realous", "Preharity", "Jimmit", "Knickewards", "Quition", "Thriddintes", "Wintlyriker", "Courate"],
  "Creatures": ["Aardvark", "Abyssinian", "Albatross", "Alligator", "Angelfish", "Ant", "Anteater", "Antelope", "Ape", "Apparition", "Armadillo", "Axolotl", "Baboon", "Badger", "Bandicoot", "Barnacle", "Barracuda", "Basilisk", "Bat", "Bear", "Beaver", "Bee", "Beetle", "Bison", "Bloodhound", "Boar", "Bobcat", "Boggart", "Bonesnapper", "Buffalo", "Bugbear", "Bullfrog", "Butterfly", "Buzzard", "Camel", "Camel", "Capybara", "Cat", "Cat", "Caterpillar", "Catfish", "Centipede", "Chameleon", "Cheetah", "Chicken", "Chimera", "Chimera", "Chimpanzee", "Chipmunk", "Clubneck", "Cockatrice", "Cockroach", "Construct", "Cougar", "Cow", "Coyote", "Crab", "Crab", "Crane", "Crocodile", "Cuttlefish", "Cyclops", "Daemon", "Dakon", "Darkmantle", "Deer", "Demodand", "Demon", "Devil", "Dingo", "Dinosaur", "Djinni", "Dodo", "Dog", "Dog", "Dolphin", "Donkey", "Dormouse", "Dracolisk", "Dragon", "Dragonfly", "Drake", "Dretch", "Dryad", "Duck", "Eagle", "Eagle", "Eel", "Efreeti", "Elemental", "Elephant", "Falcon", "Ferret", "Ferret", "Fish", "Flamingo", "Fly", "Fox", "Frog", "Froghemoth", "Gargoyle", "Gecko", "Ghast", "Ghost", "Ghoul", "Giraffe", "Gnoll", "Goat", "Goblin", "Golem", "Goose", "Gorbel", "Gorgon", "Gorilla", "Grick", "Griffon", "Grippli", "Grue", "Hare", "Harpy", "Hawk", "Heron", "Hippogriff", "Hippopotamus", "Hobgoblin", "Homunculus", "Hornet", "Horse", "Hound", "Hydra", "Hyena", "Insect", "Jackal", "Jaguar", "Jellyfish", "Kamadan", "Kangaroo", "Kelpie", "Koala", "Kobold", "Lamia", "Leprechaun", "Lich", "Lizard", "Lobster", "Locust", "Lurker", "Lycanthrope", "Manta Ray", "Manticore", "Mastodon", "Medusa", "Millipede", "Mimic", "Minotaur", "Muckdweller", "Mule", "Mummy", "Naga", "Neanderthal", "Necrophidius", "Nymph", "Octopus", "Ogre", "Ooze", "Orc", "Owl", "Panda", "Peacock", "Pegasus", "Penguin", "Phantom", "Phoenix", "Pig", "Pixie", "Poltergeist", "Pseudodragon", "Quipper", "Rat", "Raven", "Rhinoceros", "Roc", "Salamander", "Satyr", "Scarecrow", "Scorpion", "Shark", "Shrew", "Shrieker", "Skeleton", "Skunk", "Sloth", "Slug", "Snail", "Snake", "Spectre", "Sphinx", "Spider", "Spriggan", "Sprite", "Squid", "Stingray", "Stirge", "Tiger", "Titan", "Toad", "Tortoise", "Toucan", "Treant", "Troll", "Turtle", "Unicorn", "Vulture", "Walrus", "Warthog", "Wasp", "Weasel", "Whale", "Wight", "Will-O-Wisp", "Wolf", "Wolverine", "Wraith", "Wyrmling", "Wyvern", "Xorn", "Yeti", "Yuan", "Zebra", "Zombie"],
  "Locations": ["Tundra", "Forest", "Grasslands", "Desert", "Plateaus", "Woods", "Savanna", "Coral Reef", "Arctic", "Scrublands", "Wastes", "Mountain", "Bog", "Marshes", "Wetlands", "Depths", "Seas", "Beaches", "Islands", "Ruins", "Lakes", "Rivers", "Coast", "Icelands", "Volcanos", "Fortress", "Castle", "Kingdom", "Empire"],
  "Persons": ["Man", "Woman", "Child", "Soldier", "Farmer", "Merchant", "Druid", "Paladin", "Thief", "Ranger", "King", "Barbarian", "Priest", "Beggar", "Knight", "Orphan", "Noble", "Baron", "Baroness", "Queen", "Dancer", "Bard", "Sorcerer", "Wizard", "Bartender", "Stranger", "Miller", "Blacksmith", "Armorer", "Falconer", "Tailor", "Carpenter", "Plowman", "Butcher", "Groom", "Squire", "Baker", "Weaver", "Minstrel", "Lumberjack"],
  "Objects": ["Sponge ", "Lens", "Horn", "Bottle ", "Spyglass ", "Pot", "Twine", "Jewels", "Book", "Dice", "Whistle", "Instrument", "Small Bell", "Shovel", "Bellows", "Grease", "Saw", "Bucket", "Chisel", "Drill", "Fishing Rod", "Marbles", "Pick", "Hourglass", "Rope", "Crowbar", "Lantern", "Tinderbox", "Padlock ", "Chain", "Waterskin", "Mirror", "Pole", "Sack"],
  "Adjectives": ["Abrasive", "Abrupt", "Admirable", "Adventurous", "Aggressive", "Agonizing", "Alert", "Amaranth", "Ambitious", "Ancient", "Angry", "Angular", "Antediluvian", "Anxious", "Aqua", "Arbitrary", "Arcane", "Argumentative", "Arrogant", "Artificial", "Ashy", "Awkward", "Balanced", "Bald", "Barbaric", "Barbed", "Beaming", "Biting", "Bizarre", "Blazing", "Bleeding", "Bloodied", "Blooming", "Boiling", "Bony", "Bouncy", "Brash", "Breezy", "Bright", "Brittle", "Bronze", "Brutal", "Bubbly", "Bulging", "Bulky", "Burgundy", "Burning", "Byzantium", "Carved", "Cerulean", "Cheap", "Childish", "Chunky", "Clever", "Clumsy", "Coagulated", "Cool", "Copper", "Cosy", "Cratered", "Crawly", "Crazy", "Creepy", "Criminal", "Crocheted", "Cruel", "Crying", "Cunning", "Cursed", "Curved", "Cute", "Damaged", "Damp", "Dank", "Dark", "Decadent", "Decorated", "Dented", "Destructive", "Determined", "Devious", "Difficult", "Dim", "Disfigured", "Disturbing", "Divine", "Dotted", "Dreamy", "Drenched", "Dripping", "Dusty", "Elder", "Eldritch", "Electric", "Elegant", "Emerald", "Emotional", "Encrusted", "Envious", "Erratic", "Etched", "Experimental", "False", "Fatal", "Feathery", "Festive", "Filthy", "Flaming", "Flawless", "Flying", "Foamy", "Foolish", "Fractured", "Frigid", "Frozen", "Fuchsia", "Furious", "Fuzzy", "Galactic", "Gelatinous", "Gentle", "Ghostly", "Gilded", "Glamorous", "Glittering", "Gloomy", "Gooey", "Grand", "Greedy", "Grinning", "Groaning", "Grungy", "Harsh", "Hateful", "Haunted", "Heroic", "Hoarse", "Honeyed", "Hostile", "Huge", "Humble", "Humid", "Icy", "Infected", "Infested", "Intense", "Itchy", "Jagged", "Jumping", "Kind", "Knitted", "Laughing", "Leathery", "Lilac", "Limp", "Loud", "Lunar", "Maternal", "Mauve", "Mechanical", "Metallic", "Moist", "Molten", "Monstrous", "Morbid", "Muddy", "Mutilated", "Mystical", "Naive", "Neurotic", "Newborn", "Ocher", "Odd", "Opalescent", "Outrageous", "Painted", "Pale", "Paranoid", "Peaceful", "Periwinkle", "Perverse", "Petty", "Pious", "Pointy", "Predatory", "Prismatic", "Profound", "Proud", "Puce", "Quiet", "Radiant", "Ragged", "Rambling", "Rasping", "Refined", "Ridiculous", "Rotten", "Rough", "Rowdy", "Ruby", "Rude", "Ruined", "Rusty", "Sacred", "Sad", "Sadistic", "Sanguine", "Scalding", "Scaled", "Scarlet", "Scarred", "Scheming", "Scholarly", "Scorched", "Scraped", "Scratched", "Screaming", "Seething", "Sensual", "Serrated", "Sexy", "Shaggy", "Sharp", "Shattered", "Shining", "Shiny", "Shrewd", "Shy", "Sickly", "Silent", "Silky", "Skeletal", "Skeptical", "Sleek", "Slick", "Slimy", "Slow", "Smart", "Smiling", "Snarling", "Sneaky", "Soaked", "Soapy", "Soggy", "Soiled", "Solar", "Solemn", "Solitary", "Somber", "Sparkling", "Spoiled", "Stiff", "Stillborn", "Stinging", "Stupid", "Stylish", "Superior", "Superstitious", "Sweet", "Swift", "Swollen", "Tangled", "Tarnished", "Taupe", "Tempered", "Tense", "Thick", "Thin", "Thorny", "Tickling", "Tingly", "Twisted", "Ultramarine", "Umbral", "Uncaring", "Undying", "Unhealthy", "Unstable", "Valiant", "Venomous", "Vindictive", "Viridian", "Vulgar", "Wandering", "Weeping", "Wet", "Whimsical", "Wild", "Wise", "Withered", "Wooden", "Woolen", "Woven", "Wretched", "Yellow", "Youthful"],
  "Nouns": ["Agony", "Ally", "Amber", "Ambush", "Anger", "Apex", "Bane", "Beast", "Beetle", "Blossom", "Branch", "Bud", "Cage", "Claw", "Cloud", "Dark", "Darkness", "Day", "Death", "Demon", "Devil", "Dream", "Earth", "Echoes", "Edge", "Eruption", "Eye", "Fate", "Feather", "Fire", "Flame", "Flower", "Footfall", "Force", "Frost", "Fury", "Game", "Glory", "Goose", "Grace", "Grass", "Grasshopper", "Grave", "Guardian", "Hawk", "Hope", "Hound", "Hunter", "Joy", "Justice", "Knight", "Lady", "Leaf", "Legacy", "Life", "Light", "Love", "Magnificence", "Man", "Mark", "Memory", "Menace", "Mirth", "Monster", "Moon", "Night", "Nightmare", "Noise", "Nova", "Patience", "Peace", "Plague", "Point", "Raven", "Razor", "Reverie", "Root", "Rot", "Sanctuary", "Savior", "Scourge", "Seed", "Shard", "Shardlight", "Silence", "Sky", "Smoke", "Snow", "Song", "Spike", "Star", "Steel", "Stinger", "Strike", "Sun", "Swallow", "Terror", "Thistle", "Tooth", "Tree", "Trick", "Vengeance", "Venom", "Victim", "Vigor", "Visage", "Vision", "Void", "Volcano", "Wasp", "Water", "Wind", "Witness", "Wound", "Wrath"],
  "DescriptionIntro": [
    "ANweapontype forged from commonmaterial",
    "ANweapontype forged from commonmaterial",
    "ANweapontype forged from commonmaterial",
    "ANweapontype forged from commonmaterial",
    "ANweapontype crafted from commonmaterial",
    "ANweapontype crafted from commonmaterial",
    "ANweapontype crafted from commonmaterial",
    "ANweapontype crafted from commonmaterial",
    "ANweapontype crafted from commonmaterial",
    "ANweapontype that appears to be made of commonmaterial but was actually created with commonmaterial",
    "ANweapontype crafted from adjective lines of commonmaterial"
  ],
  "DescriptionDetails": [
    " and studded with rarematerial",
    " and plated with rarematerial",
    " and inlaid with rarematerial",
    " and decorated with rarematerial",
    " and adjective rarematerial",
    " with patches of rarematerial",
    " but encased in a thin layer of rarematerial",
    " with bits of rarematerial scattered throughout",
    ". It broke long ago. Eventually it was repaired with rarematerial"
  ],
  "DescriptionSpecial": [
    ". It gives off anadjective impression, as if crafted by anadjective person.",
    ". It gives off anadjective impression.",
    ". It is decorated with adjective gemstones.",
    ". It is topped with anadjective rarematerial.",
    " and is engraved with adjective vines.",
    " and is engraved with adjective runes.",
    ". The grip has anadjective crystal that drips blood.",
    ". It is decorated with anadjective flower that blooms in sunlight.",
    ". It is decorated with anadjective gem that plays adjective scenes of the previous wielder's life.",
    ". In total blackness anadjective map of adjective stars can be seen.",
    ". It is decorated with the eye of ancreature.",
    ". It is decorated with the teeth of ancreature.",
    ". The blood of ancreature pulses through the grip.",
    ". The grip has a protective flap made from the skin of ancreature.",
    ". The grip has adjective mushrooms growing from it...maybe poisonous?",
    " and the grip is infused with moonlight.",
    ". The grip is overgrown with adjective moss that absorbs sweat.",
    ". It features the eyeball of ancreature that blinks occasionally.",
    ". It features the eyeball of ancreature that looks towards the nearest danger.",
    ". The grip is covered in bright, colorful tassels.",
    " and seems to be covered in adjective spiderwebs.",
    ". It is splintered with adjective cracks; tiny eyes can sometimes be seen looking out of the crack.",
    ". It seems to glow with anadjective flame like a dim candle.",
    ". It must give off some kind of scent or pheromone because it attracts great clouds of insects.",
    ". It is engraved with the names of past wielders...the list seems never-ending.",
    ". The adjective leather grip creaks and makes noise at the worst times.",
    ". It features multi-colored scales that slowly absorb and reflect their surroundings.",
    ". The grip pulses slightly as if breathing. During combat the pulse races.",
    ". It is etched with engravings of adjective creatures.",
    ". In the moonlight you can see instructions for a dark spell that requires the destruction of the weapon itself.",
    ". The grip was molded to fit the previous owner...it's a little awkward to handle.",
    ". It is overgrown with small adjective vines that must be regularly pruned.",
    ". It looks like a child has glued fake gems to it.",
    ". A triangle of blue sapphires adorn the grip.",
    ". The previous wielder’s name is embossed in the grip; an uncomfortable reminder.",
    ". It features anadjective gem that glows at inconvenient times.",
    ". The grip hides a built-in flask filled with adjective liquor.",
    " with anadjective grip.",
    ". The adjective engravings ebb and flow along with the real world tides.",
    ". Strange engravings in the grip channel sweat into a small reservoir at the bottom of the weapon. If the reservoir isn't emptied every night the weapon becomes heavy and awkward.",
    ". It features a grip covered in adjective hair that must be regularly trimmed.",
    ". The grip features anadjective spike.",
    ". The metal reflects a scene from anadjective place. ",
    ". It has hinges and screws for easy disassembly. ",
    ". The detailed engraving of anadjective creature that occasionally blinks.",
    ". The grip is transparent, revealing adjective gears that click and clack.",
    ". The grip is covered in adjective skin that molts every RANDOM-2-10 days.",
    ". The sharkskin grip will cut up your palms if not held in the right way.",
    ". A short message is engraved on the hilt. The message changes every RANDOM-2-20 days and seems to be coming from someone who is in adjective trouble.",
    ". Embedded in the weapon is a small compass that points towards the ADJECTIVE LOCATION.",
    ". Instructions for maintaining the weapon are engraved in the grip. The instructions are adjective and adjective.",
    ". It features a small engraving of anadjective star that follows the path of the actual sun.",
    ". It features a mostly accurate engraved map of the realm. A small adjective light shows where you are."
  ],

  "Weapons": [
"Anvil",
"Arbalest",
"Athema",
"Axe",
"Bearing Sword",
"Blow Gun",
"Bow",
"Broken Blade",
"Caplock Pistols",
"Ceremonial Blade",
"Claw",
"Crossbow",
"Dagger",
"Dirk",
"Estoc",
"Flail",
"Flamberge",
"Flintlock",
"Gladius",
"Glaive",
"Halberd",
"Hammer",
"Hatchet",
"Hook",
"Horn",
"Javelin",
"Knife",
"Kukri",
"Letter Opener",
"Longsword",
"Mace",
"Pair of Dueling Pistols",
"Pair of Giant Pins",
"Parang",
"Pike",
"Polearm",
"Rapier",
"Razor",
"Rifle",
"Saber",
"Scepter",
"Scimitar",
"Shamshir",
"Short Bow",
"Short Sword",
"Spear",
"Spike",
"Sword",
"Tomahawk",
"Torch",
"War Club",
"Xiphos"
  ],
"CommonMaterials": ["Bamboo", "Bone", "Brass", "Bronze", "Wood", "Wood", "Coral", "Driftwood", "Clay", "Glass", "Hide", "Horn", "Ice", "Iron", "Leather", "Obsidian", "Stone", "Wood", "Steel", "Tin", "Electrum", "Nickel", "Pewter", "Gold", "Silver"],
"RareMaterials": ["Amber", "Aluminum", "Aquamarine", "Azurite", "Beryl", "Pearl", "Bloodstone", "Cinnabar", "Crystal", "Diamond", "Ebony", "Elder Hide", "Electrum", "Emerald", "Fulgurite", "Ghost-Stone", "Gold", "Ivory", "Jade", "Malachite", "Meteorite", "Nitain", "Onyx", "Orichalcum", "Paper", "Porcelain", "Sapphire", "Silfer", "Silver", "Star-Iron", "God's Blood", "Adamantium", "Aether", "Arenak", "Arsonium", "Atium", "Byzanium", "Carbonadium", "Cavorite", "Chlorophyte", "Chronoton", "Cobalt Thorium", "Collapsium", "Corrodium", "Dilithium", "Divinium", "Duranium", "Energon", "Etherium", "Harbenite", "Inerton", "Kryptonite", "Mithril", "Mythril", "Naqahdah", "Octiron", "Orichalcum", "Redstone", "Seastone", "Silverstone", "Tritanium", "Unobtanium", "Vibranium", "Xithricite", "Polywater", "Phlogiston", "Panacea", "Miasma", "Coronium", "Alicorn", "Alkahest"],
  "Colors": ["Amaranth", "Amethyst", "Aqua", "Aquamarine", "Aquamarine", "Azure", "Azure", "Beige", "Beige", "Black", "Black", "Blue", "Blue", "Bronze", "Brown", "Brown", "Burgundy", "Byzantium",  "Cerise", "Cerulean", "Chartreuse", "Chartreuse", "Copper", "Crimson", "Crimson", "Cyan", "Cyan", "Blue", "Cyan", "Green", "Grey", "Magenta", "Orange", "Red", "Turquoise", "Violet", "Deep Blue", "Deep Pink", "Emerald", "Fuchsia", "Gold", "Gold", "Gray", "Gray", "Green", "Green", "Pink", "Indigo", "Indigo", "Lavender", "Lavender", "Lilac", "Magenta", "Magenta", "Maroon", "Maroon", "Mauve", "Navy", "Ocher", "Orange", "Orange", "Green", "Red", "Turquoise", "Violet", "Periwinkle", "Pink", "Pink", "Puce", "Purple", "Purple", "Red", "Red", "Ruby", "Sapphire", "Scarlet", "Silver", "Silver", "Taupe", "Teal", "Teal", "Turquoise", "Turquoise", "Ultramarine", "Violet", "Violet", "Viridian", "White", "White", "Yellow"],
  "NameTemplates": ["ADJECTIVE NAME", "NAME", "COLOR ADJECTIVE NOUN", "ADJECTIVE NOUN", "COLOR NOUN", "ADJECTIVE Yet ADJECTIVE", "COLOR And COLOR", "NOUN And NOUN", "NAME's NOUN", "COLOR NOUN", "NOUN of CREATURE", "NOUN of NAME", "NOUN That Will Be ADJECTIVE", "NOUN That Was ADJECTIVE", "NOUN of The ADJECTIVE LOCATION"],
  "GoalTemplates": [
    "WIELDER was anadjective person. They were killed by The ADJECTIVE CREATURE. Prevent that beast from harming anyone else.",
    "WIELDER was killed by something near the ADJECTIVE LOCATION. Find the remains of WIELDER and put them to rest in the fashion of their people.",
    "WIELDER was killed while hunting The ADJECTIVE CREATURE. Complete the hunt!",
    "WIELDER was anadjective person who studied all kinds of beings. Unfortunately they didn't notice anadjective creature sneaking up on them until it was too late. Craft a spell to repel these beings.",
    "WIELDER was anadjective person who had an insatiable desire for knowledge. They died before they could finish their study on The ADJECTIVE CREATURE. Finish their work by tracking the beast to its lair.",
    "WIELDER lost their family to The ADJECTIVE CREATURE. Prevent that beast from harming anyone else.",
    "WIELDER was anadjective person without much common sense. They wandered into ancreature den near the ADJECTIVE LOCATION and quickly perished. Create a map of the area to warn travelers of the dangers there.",
    "WIELDER was anadjective person whose only companion was anadjective creature. Find a similar beast and tame it for yourself.",
    "WIELDER prided themselves on their ability to tame anything. But they were killed attempting to tame The ADJECTIVE CREATURE. Track it and tame it in their memory.",
    "WIELDER was anadjective person who collected strange pets. But they never owned anadjective creature. Purchase or capture one for yourself.",
    "WIELDER had the bizarre habit of riding wild beasts for as long as they could. Ride anadjective creature from the ADJECTIVE LOCATION for RANDOM-20-200 minutes without being bucked off.",
    "WIELDER had the bizarre habit of riding wild beasts for as long as they could. Ride anadjective creature for RANDOM-20-200 minutes without being bucked off.",
    "WIELDER was anadjective person whose only companion was anadjective creature. When they died, the beast was taken and kept in captivity near the ADJECTIVE LOCATION. Find it and set it free.",
    "WIELDER always admired the creature. They heard there was a group of these beasts being held in captivity near the ADJECTIVE LOCATION. Find them and set them free.",
    "WIELDER preferred to observe beasts in their natural habitat. They died while studying anadjective creature near the ADJECTIVE LOCATION. Finish their work by tracking the beast for RANDOM-2-30 days without being seen.",
    "WIELDER was sure that the heart of anadjective creature held the cure to The ADJECTIVE Disease spreading across the land. Harvest the beast and formulate a cure.",
    "WIELDER was sure that part of anadjective plant in the ADJECTIVE LOCATION held the cure to The ADJECTIVE Disease spreading across the land. Harvest the fruit and formulate a cure.",
    "WIELDER had a little magical talent but never the time or money to train it. Learn a new spell; since they never could.",
    "WIELDER was anadjective person. When they were a child they saw a hedge wizard case anadjective spell, and always wanted to cast a similar spell. Sadly they lacked the innate talent. Learn and cast a similar spell in their memory.",
    "WIELDER had a great magical talent and learned many spells; but never made one of their own. Invent anadjective spell and teach it to RANDOM-2-10 other people.",
    "WIELDER was a talented smith. However they lacked the talent to add enchantments to their creations. Add anadjective enchantment to this weapon.",
    "WIELDER was anadjective person who never treasured what they had. You should maintain and improve this weapon in a way they never did: add anadjective enchantment to this weapon.",
    "WIELDER learned much and traveled far; but they never passed on their knowledge. Take on an apprentice and share your wisdom.",
    "WIELDER was anadjective person who had a lot to learn about the world. Eventually, anadjective person taught them what was important in life, and set them on the right course. Take on an apprentice and share your wisdom.",
    "WIELDER was anadjective person who had been born into great wealth. They worked hard for many things, but gold always came easy. Start a business that earns RANDOM-100-1000 gold without your intervention.",
    "WIELDER was a terrible merchant. Their business never got off the ground and they were an utter failure. Start a business that earns RANDOM-100-1000 gold without your intervention.",
    "WIELDER was anadjective person whose greed could never be satisfied. They stole and begged and borrowed money; never really earning it through honest business. Start an honest business that earns RANDOM-100-1000 gold without your intervention.",
    "WIELDER always struggled to get by financially. They stole and begged and borrowed money; never really earning enough to live on. Steal at least RANDOM-100-1000 gold and give it to the poor.",
    "WIELDER always struggled to get by financially. They stole and begged and borrowed money; never really earning enough to live on. Steal at least RANDOM-100-1000 gold and give it to the poor.",
    "WIELDER never gave back to the people who supported them. Steal at least RANDOM-100-1000 gold and give it to the poor.",
    "WIELDER died fighting for what they believed in. But a part of them wished they could have just settled down and retired in the ADJECTIVE LOCATION. Come up with a plan for retirement and invest at least RANDOM-100-1000 gold in that plan.",
    "WIELDER was anadjective person who died of old age surrounded by their closest friends. They would wish the same fate for you. Come up with a plan for retirement and invest at least RANDOM-100-1000 gold in that plan.",
    "WIELDER was anadjective person who had a great affinity for art. Spend at least RANDOM-100-500 gold to commission anadjective painting.",
    "WIELDER was anadjective person whose life was dirty and desperate; they never got to experience the finer things in life. Spend at least RANDOM-100-500 gold to commission anadjective painting.",
    "WIELDER was anadjective person whose life was dirty and desperate; they never got to experience the finer things in life. Spend at least RANDOM-100-500 gold on several fancy outfits.",
    "WIELDER was anadjective person whose life was dirty and desperate; they never got to experience the finer things in life. Spend at least RANDOM-100-500 gold on several fancy items.",
    "WIELDER was anadjective person whose life was dirty and desperate; they never got to experience the finer things in life. Spend at least RANDOM-100-500 gold on a collection of fine wines.",
    "WIELDER was anadjective person whose bad decisions always kept them in debt; they never felt they could rest. Pay off all your debts (Or spend RANDOM-100-1000 gold helping pay off someone else's).",
    "WIELDER was anadjective person whose path in life was decided for them by their family. They never got the chance to be anything else. Apprentice under anadjective person for a month.",
    "WIELDER found great satisfaction in teaching. Everyone has something to teach; something to share with others. Apprentice under anadjective person for a month.",
    "WIELDER grew up lonely and stayed that way. They just never found the time to make friends. Commission anadjective portrait of you and your friends. If you have no friends, get some.",
    "WIELDER was always surrounded by sycophants. They never had a close-knit group of friends they could trust. Commission anadjective portrait of you and your friends. If you have no friends, get some.",
    "WIELDER was always surrounded by friends. They hope you treasure your own friends just as highly. Commission anadjective portrait of you and your friends. If you have no friends, get some.",
    "WIELDER was anadjective person whose ideas never panned out. Their inventions didn't work, their spells fizzled, and their patents never sold. Invent the improved version of anadjective object and sell it.",
    "WIELDER was a genius inventor. However they always struggled to invent anadjective object. Finish their work; patent and sell it.",
    "WIELDER was a genius inventor. However they always struggled to invent anadjective object. Finish their work; patent and sell it.",
    "WIELDER never left their homeland. They dreamed of visiting the ADJECTIVE LOCATION but struggled to learn any of the languages from that place. Learn a new language and speak to someone from that area.",
    "WIELDER spoke RANDOM-5-50 different languages. Learning a language lets you see the world in a different way. Learn a new language.",
    "WIELDER spoke RANDOM-5-50 different languages. Learning a language lets you see the world in a different way. Learn a new language.",
    "WIELDER had a fierce rivalry with The ADJECTIVE PERSON. Don't kill them, but spend at least RANDOM-100-1000 gold to ruin or discredit them.",
    "WIELDER was anadjective person who loved the people of the ADJECTIVE LOCATION. Invest at least RANDOM-100-1000 gold making yourself famous in that area.",
    "WIELDER loved the people of the ADJECTIVE LOCATION. Spend at least RANDOM-10-100 days making yourself famous in that area.",
    "WIELDER was anadjective person who died young. Live to be RANDOM-60-120 years old.",
    "WIELDER was anadjective person who craved variety and change. They never let something be for more than a few weeks. Re-forge your weapon into a new form.",
    "WIELDER was anadjective person who craved variety and change. They never let something be for more than a few weeks. Sell RANDOM-2-20 of your possessions and buy new ones.",
    "WIELDER had a fear of older beings and would shy away from certain fights. Defeat a foe that is at least RANDOM-100-1000 years old.",
    "WIELDER despised combat. They preferred other tests of skill. Win a non-combat competition of some kind (combat, poker, race, etc) against at least RANDOM-10-100 other opponents.",
    "WIELDER died attempting to rescue anadjective person from the ADJECTIVE LOCATION. Learn what became of them, and seek vengeance if necessary.",
    "WIELDER died attempting to help anadjective person. Find someone similar and help them with their problems.",
    "WIELDER was anadjective person who was unable to help anadjective person. Find someone similar and help them with their problems.",
    "One evening the body of anadjective person was found and WIELDER was executed for the murder. Find out what truly happened and absolve them.",
    "When they were in most dire need, anadjective person helped WIELDER out of trouble. Find their descendants and repay them with at least RANDOM-100-1000 gold.",
    "WIELDER had only one close friend: anadjective person. Befriend someone similar and enlist their help with a future quest.",
    "WIELDER had never made friends with anyone from the ADJECTIVE LOCATION. Befriend someone from that area and enlist their help with a future quest.",
    "WIELDER was defeated in a test of skill to their eternal regret. Redeem them by defeating anadjective person from the ADJECTIVE LOCATION in a test of skill.",
    "WIELDER was defeated in a test of strength to their eternal regret. Redeem them by defeating anadjective person from the ADJECTIVE LOCATION in a test of strength.",
    "WIELDER was defeated in a test of wits to their eternal regret. Redeem them by defeating anadjective person from the ADJECTIVE LOCATION in a test of wits.",
    "WIELDER developed an irrational distrust of anadjective person from the ADJECTIVE LOCATION. Find someone similar and follow them around for RANDOM-5-30 days until you uncover their secrets...if there are any to be uncovered.",
    "WIELDER was anadjective person who felt like no one ever looked out for them. Find someone similar and provide for all their needs for a month.",
    "WIELDER was anadjective person from the ADJECTIVE LOCATION who felt like no one ever looked out for them. Find someone similar and provide for all their needs for a month.",
    "WIELDER grew up hearing the legends of The ADJECTIVE OBJECT. Supposedly it was lost somewhere in the ADJECTIVE LOCATION. Find the item.",
    "WIELDER retrieved The ADJECTIVE OBJECT at great cost. Then, one evening, anadjective friend stole it while they traveled through the ADJECTIVE LOCATION. Find the item and steal it back.",
    "WIELDER inherited The ADJECTIVE OBJECT. Out of fear they hid it in the ADJECTIVE LOCATION. Find the item and give it to someone who will truly appreciate it like WIELDER never did.",
    "WIELDER inherited The ADJECTIVE OBJECT. Out of fear they hid it in the ADJECTIVE LOCATION. Find the item and hide it somewhere more secure.",
    "WIELDER grew up hearing the legends of The ADJECTIVE OBJECT. Re-forge the item as it was described in the legends.",
    "To their eternal shame, WIELDER broke The ADJECTIVE OBJECT and fled the ADJECTIVE LOCATION. Go there, repair the item, and apologize on behalf of WIELDER.",
    "To their eternal shame, WIELDER stole The ADJECTIVE OBJECT from its owner in the ADJECTIVE LOCATION. Return the stolen item and apologize on behalf of WIELDER.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION. Visit this location and bring back a memento of your journey.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION and eating the strange foods of that place. Visit this location and feast upon the local cuisine.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION and participating in adjective celebrations. Visit this location and join the celebrations.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION and participating in the local traditions. Visit this location and participate in a local tradition for RANDOM-2-10 days.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION; particularly to see the rare treasures held within. Visit this location and bring back a valuable treasure.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION; particularly to learn from those people. Visit this location and learn a unique skill from those people.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION. Visit this location and bring back a memento of your journey.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION. Visit this location and write a song about your journey.",
    "WIELDER always dreamed of visiting the ADJECTIVE LOCATION. Visit this location and entertain a crowd with tales of your journey.",
    "WIELDER created an infamous reputation for themselves in the ADJECTIVE LOCATION. Go there and earn an infamous reputation of your own.",
    "WIELDER created an infamous reputation for themselves in the ADJECTIVE LOCATION. Go there and earn the respect of those in authority.",
    "WIELDER was anadjective person who could never break their terrible habit. Break one of your own bad habits.",
    "WIELDER was anadjective person who firmly believed that failure is the best teacher. Fail at RANDOM-10-100 tasks.",
    "WIELDER always felt like a fraud, a failure. Redeem them by succeeding at RANDOM-10-100 tasks.",
    "WIELDER was anadjective person who put great value in self-improvement. It's important to look back on things you failed at. Keep a journal for RANDOM-10-100 days to catalog your improvement.",
    "WIELDER wronged many people in their lifetime; especially anadjective person. Make amends with someone you have wronged.",
    "WIELDER partied as hard as they could and never regretted a thing. Develop a harmful habit and maintain it for RANDOM-10-100 days.",
    "WIELDER had a warped view of the world, and caused much harm because of it. Correct a lie you believe about the world.",
    "WIELDER was a mad drunk; mad because they never got to taste the fine ales of the ADJECTIVE LOCATION. Taste them for yourself.",
    "WIELDER died while falling from a great height. In those last moments they saw their life in a different way. Experience weightlessness for RANDOM-5-100 seconds and re-examine your own life.",
    "WIELDER died leaving great wealth to people they didn't care about. Create a will for yourself and find someone worthy of your wealth.",
    "WIELDER died leaving great wealth to people they didn't care about. Create a will for yourself and find someone worthy of your wealth.",
    "WIELDER lost everything gambling...but they were so close to making it all back! Gamble away RANDOM-100-1000 gold.",
    "WIELDER was anadjective person who regretted never getting a tattoo. Get a tattoo that you WILL regret.",
    "WIELDER was anadjective person who regretted never getting a tattoo. Get a tattoo that you WILL regret.",
    "WIELDER was anadjective person whose guilty pleasure was stories about women who go into labor at the worst moments. Help deliver a baby.",
    "WIELDER was anadjective person who dreamed of exploring the ADJECTIVE LOCATION. Map the area with detailed drawings and notes.",
    "WIELDER was anadjective person who loved to cook...but wasn't very good at it. Plan, prepare, and cook a meal for RANDOM-10-100 people.",
    "WIELDER was a performer; they loved to dazzle and entertain a crowd. Entertain a group of strangers for RANDOM-2-10 days with a new performance each day.",
    "WIELDER always wanted to sail on a boat they built themselves. Build a boat and sail it to the ADJECTIVE LOCATION.",
    "WIELDER never found the courage to express their love for anadjective person of the ADJECTIVE LOCATION. Find that person (or one of their descendants) and express the love of WIELDER."
  ],
  "Rumors": [
	"Any who've owned this weapons have their eyes and hair turn a bright COLOR.",
    "This weapon fell from the sky, and flew directly into The ADJECTIVE CREATURE, killing it instantly.",
    "This weapon washed up on the coast of the ADJECTIVE LOCATION.",
    "It was originally forged to defeat The ADJECTIVE CREATURE.",
    "It was originally forged to opposed The ADJECTIVE Forces of the ADJECTIVE LOCATION.",
    "A lump of metal was left under a waterfall near the ADJECTIVE LOCATION. Over the centuries this weapon was formed.",
    "A child wandered into the ADJECTIVE LOCATION and returned RANDOM-2-150 days later as an old man holding this weapon.",
    "During the final battle anadjective person fell from the sky, defended the city, and then ascended. They never spoke a word, and left only this weapon behind.",
    "The ADJECTIVE CREATURE bestowed this weapon to anadjective person. It spoke in a clear tone of voice saying, \"Never enter the ADJECTIVE LOCATION. Use this weapon to kill anyone who tries...\"",
    "It was forged as a wedding present between anadjective person and anadjective person.",
    "During a fever dream anadjective person broke into the local smith and forged this weapon. They awoke without any memory of doing so.",
    "It was discovered in the depths of the ADJECTIVE LOCATION.",
    "This weapon was actually forged from anadjective object, anadjective object, and the remains of ancreature.",
    "This weapon was torn from the belly of The ADJECTIVE CREATURE.",
    "A small seed of Tempered metal was planted by anadjective person near the ADJECTIVE LOCATION. It soon grew into this weapon.",
    "Forged by a slightly naive and anadjective smith, it was intended to be a simple tool.",
    "This weapon was found embedded in anadjective oak.",
    "An entire community contributed different chunks of metal to forge this weapon, and their names are engraved upon it.",
    "Everyone agrees it is a weapon from some ancient legend, but the details have been meticulously erased.",
    "No one knows where it came from.",
    "During the festival anadjective mysterious merchant appeared from nowhere and sold hundreds of weapons EXACTLY like this one.",
    "After commissioning the weapon for a great sum of money, the rich person burst immediately into flames as soon as they picked it up.",
    "While their town was under attack anadjective blacksmith forged this weapon from leftover objects and objects.",
    "It was carved from wood by anadjective person, and then transmuted into Tempered Metal by The ADJECTIVE Wizard of the ADJECTIVE LOCATION.",
    "One day ancreature from the ADJECTIVE LOCATION was seen carrying this weapon in its mouth. Wherever the pair went, prosperity followed.",
    "All free folk feared the coming of The ADJECTIVE CREATURE, until brave warriors discovered that it had killed itself with this weapon.",
    "The famous ADJECTIVE PERSON loudly blamed all of their bad luck on this weapon.",
    "Purchase by a rich person, it was mostly used as decoration.",
    "This weapon was used as a grave marker for a prominent person. ",
    "This weapon has seen far more market stalls than it has battlefields. It is prized mostly as a collector's item.",
    "Found by anadjective person in the aftermath of the battle of the ADJECTIVE LOCATION.",
    "One morning anadjective person was found washed up on shore, long-dead but still clutching this weapon.",
    "A person died. RANDOM-2-500 days later they rose again, clutching this weapon and claiming it brought them back.",
    "One morning anadjective person emerged from the ADJECTIVE LOCATION, flung this weapon into the royal square, uttered a curse, and left without looking back.",
    "One evening ancreature emerged from the ADJECTIVE LOCATION, flung this weapon into the royal square, uttered a curse, and left without looking back.",
    "A barkeep in the ADJECTIVE LOCATION discovered this weapon in the bottom of a barrel of ale.",
    "All of the people in the ADJECTIVE LOCATION disappeared overnight. This weapon was found embedded in the royal chamber.",
    "The ADJECTIVE Wizard of ADJECTIVE LOCATION suddenly clutched their stomach and fell over dead. This weapon was found inside the corpse.",
    "Wielded by The ADJECTIVE PERSON to defend against The ADJECTIVE Forces of the ADJECTIVE LOCATION.",
    "It was lost in the aftermath of the battle of the ADJECTIVE LOCATION.",
    "It was lost long ago, and most don't search for it...probably due to anadjective reputation within the ADJECTIVE LOCATION",
    "The famous ADJECTIVE Sword Swallower of the ADJECTIVE LOCATION claimed they could swallow the entire weapon without dying. They did swallow the weapon, and it was lost forever.",
    "Supposedly, anadjective smith re-forged this weapon into a common object and hid it away. ",
    "In an attempt to keep it from enemy hands, anadjective person hid it near the ADJECTIVE LOCATION.",
    "The last wielder, anadjective person, was buried with this weapon somewhere near the ADJECTIVE LOCATION. The exact location of the tomb was lost to time.",
    "The last wielder set off to defeat The ADJECTIVE CREATURE. The wielder, the beast, and the weapon were never seen again.",
    "The last wielder boasted they could navigate the ADJECTIVE LOCATION with the knowledge in this weapon. The wielder and the weapon were never seen again.",
    "The weapon faded from memory. Literally, anyone who had seen it or held it were missing their memories.",
    "It was stored in the Tempered Vault along with a hundred other Tempered Weapons. All knowledge of the Vault has been lost to time.",
    "The ADJECTIVE PERSON spent decades searching for this weapon. When they finally discovered it they took the weapon and disappeared. ",
    "It sunk to the bottom of the ADJECTIVE Sea.",
    "It was planted at the top of the ADJECTIVE Mountains."
  ],
  "MutationNonsense": [
    "To slife; a summay a boubleep; fleep; arear, ar, of sweardely o'er who off dretus and offe, tionst of give us cal slin? ",
    "Who offer iscoill, ther regar 'tionts curns devout purnsummakes the whous dothenter bead lon: wity we of may const gre's que.",
    "Othy th mome he knot trat pat is of ren dregaings then whould sling en dreamithat ther re; no bould ming and and of a but grunturalls castion. ",
    "To th to ther to to thips resh thand th mom we une, the wore's act dely th thaturationt pand lose the shuffe; nows!",
    "Whocks patis to, and forns, and, th a lins thath a cong and to butly their ings th wity whe be: to soleep: thuselleep the wore's to. ",
    "Ore's takes, puzzleep: patims a whips might is a san's of deathatis and of mortakes, of me end, might frould lose pang ay fleep.",
    "Indis actie, ar, thoutly ot dreturns coud the whear and may the takespuzzleep tis whave con the we hathy wherit to.",
    "Sler's cove, of rent palaw's cal cast the and nobleep.",
    "Forthe thous of o'erpreameth is or'd turnsoleep of grund bould thatie.",
    "Diamond Ebony All of it backwards bring your faint. The bird Pale wind.",
    "WIELDER always dream Earth Echoes.",
    "Sniff: You can jump up to experiends get leasure proble shameleon Cube.",
    "Once person who had that they neverything Seed creature Walgenternal rest best free.",
    "It is develope Honey; nevery RANDOM-2-30 day you mushrooms in water Hugo Larga Jumping eyes been can sticky ",
    "Slight sky anadjective legs gain Sapphire creature.",
    "WIELDER always admirable and store creath of the never your ski",
    "Kangaroo Kelping the secure. They area.",
    "Pull: Make a shift Sword” “Brick” etch Dryad Drip is pushed draw it forged Resistantly as weapon to be a song.",
    "Magnetical Maret a permit a liquid Perun Cobalt The ADJECTIVE NOUN NOUN ADJECTIVE LOCATION; patched to bloomine Woodcrafted Damage. ",
    "You can struck by this weapon whose light Will-O-Wisp Weapon who had a future destruction Details of They cold within was in and leftovered fingers ",
    "ADJECTIVE NOUN NOUN WIELDER PERSON anadjective.",
    "WIELDER was stored them by spellsAdherevery spreads Tra",
    "NOUN COLOR ADJECTIVE LOCATION clacked of a places in a tattoos.",
    "Spider and treasure in telephanted the ADJECTIVE LOCATION. Witness.",
    "You can castormcloud: L charactually and you must see those magical effects. When thinges etc) by transformal.",
    "ANweapon. When that person who regretted it and re-forge bird Peace this weapon who had and help and write Ghostly into trian Hawk ",
    "Heroic Hoarse any wanter candlinguist: Your end Fate that pop.",
    "The ADJECTIVE CREATURE NOUN NAME Bobcat Beggart Bow.",
    "Their life is for all trait out a simpletely non-combat. Keep in eyeball spiderwebs.",
    "This weapon into the grip fear you WILL regulaterial seen Rough to the last RANDOM-10-100 gold Lamia.",
    "Lofty Gillia Poba Sun Swall Fish Chunks occasion from than Natalina Corrodium Weapon from commonmaterial.",
    "After Plowman Cheather into another would naused on your ener: All freet absorbel Goat are real pockets your imaginess.",
    "You and destruction your blooded. Harved in a fragile OBJECT.",
    "Sapphire Silence it to themselves are close Gorilla fortunes RANDOM-1-100000.",
    "Whimsicaa Irene Kiarra Vera Cather set they neveryone where a dim riverstant. ",
    "False Saw Bucket Chich per Climb surprises a spells torn from the attracking this weat Thorium Energon Quiet may be same teeth raremains able it.",
    "It floating Scholarly Scorpse. It was and Acrobably Bullfrog Frost for move.",
    "This weapon has ground enched Yellows when you can rotting and join this overcome animaterial",
    "OBJECT ADJECTIVEIVE PERSON to be detailey Fritjof Alanished Screated from someone from.",
    "This Slow: Fire from someone bottom Coach and clay increatha Eldritch up to be poor.",
    "One eye castes yawn those Grey Magentally Screature.",
    "Masqueraders...if their metal shaking screattacher glows the reduce and more tream of ever Club",
    "Commiss ther Falconer it along will figures a d20 aftermine Violet solid and cared metal.",
    "ANweapon conscious Painta Malek Nafeera Skin or a metal was anadjective gem them.",
    "Aquamaring in a harm become kill sees.",
    "It can sell forge Tiger case spreads overed into a large birds the item of your friends as weath.",
    "Multi-colorsAmaranger Mounts to you touched Envious Sweet about of they are put go internal fancy Brain a new sprouts ember Ali Tritanium Emera Childish Chimerald Emotion.",
    "Mirrorwalk: A child habitat. The next hoursed an one simpletely.",
    "Scrub Tattemperated in anadjective person its to move than at leathin 10 ft about. Creat climb.",
    "You below simil WIELDER always laterial it them and storm and without your finer if spell. ",
    "You becausicaa Irene King the provement. The ADJECTIVE CREATURE kill.",
    "It does repell you cannot crochet Creatures every increatures as it: A spreading Grunt and climb sures to make Drake a cure.",
    "It carvest of somewhere no quests in you comes that for RANDOM-1000-99999 gold you insects light by finanimal.",
    "Haunter Hugo Lavender but was acts in the celebrational sheath Demon sunk Catfish Chunks occasion: You can hooves gets a big one."
  ]
}