{
  "locations": [
    {
      "title": "Entrance Foyer",
      "description": "<p>A small room, lit with candles, furnished with mahogany and brass. Seating and a ‘Wait Here’ sign. A desk facing towards the real world for the Library’s staff. 50% chance the desk is currently manned by a Black Librarian.</p><p>On the desk, there’s a bell to ring for attention. Roll an Encounter for what turns up every time the players ring it.</p>"
    },
    {
      "title": "Catalogue of Contents",
      "description": "<p>Chained onto a lectern, a single huge catalogue with pages the size of a human torso, bound in black leather. </p><p>The catalogue lists what books are stored nearby, and where. The instructions and directions given are confusing to follow; the PCs can get a picture of what’s nearby but actually tracking things down will be difficult. Consulting it for a turn allows one of the following benefits:</p><ul><li>Increase the party’s Progress Score by 5. This benefit can be gained only once for each piece of information sought.</li><li>Roll a random Extraordinary Book. The next time the party discovers an Extraordinary Book, this will be with it. Subsequent rolls determine the book after that, and so on. Once the party rolls the same Extraordinary Book a second time, that is all that can be found. </li></ul>"
    },
    {
      "title": "Help Desk",
      "description": "<p>In an alcove, a small desk laden with papers. Shelves behind it stuffed with more paperwork. Lit by an oil lamp.</p><p>The paperwork is largely useless to the PCs. It details things like supplies in the library, rotas for the librarians, etc. There’s enough useful information here, however, that it can help PCs find specific information. Each turn spent going through the records increases Progress by 1, to a maximum of +3.</p><p>75% chance that the desk is manned by a Yellow Librarian. The Librarian is, in fact, genuinely helpful.</p>"
    },
    {
      "title": "Reading Lounge",
      "description": "<p>A comfortable room, with richly upholstered couches, and elegant coffee tables. Cigar smoke and notebooks. 50% chance that any encounter here will be with Visitors, Researchers, Lost Souls or Archivist-Liches.</p>"
    },
    {
      "title": "Chained Lectern",
      "description": "<p>An ornate lectern, raised on a slight platform. On it, open, is a large book. Each corner of the book’s cover is fastened to the lectern, and the lectern is bolted to the floor. When nobody is observing it, it gives a soft creak or gentle rattle, as if straining against restraints.</p><p>Roll on the Extraordinary Books Table for what the book on the lectern is. This version, however, is dangerous. Reading it results in paper-cuts as the pages twist awkwardly beneath your fingers, dealing 1 damage for each turn spent reading. If two corners of the book are unfastened (perhaps in order to remove it), the book animates and rips itself free of its bindings. </p><p><strong>Furious Book</strong>: <em>HD 3, HP 12, Armour as leather, slam (+0, d6 and Intelligence Drain), Save as Fighter 3. Can levitate. Immune to poison, cold, backstabs and other effects that only affect living things. Double damage from fire.</em></p><p>Each successful hit by the book permanently reduces the victim’s Intelligence by 1; each time this happens, the book gains another chapter and a half-inch of thickness.</p>"
    },
    {
      "title": "Display Case",
      "description": "<p>A glass-fronted case displaying valuable or interesting exhibits. Roll a d20 for what:</p><ol><li>Butterflies pinned to cards.</li><li>Snake skins.</li><li>Various bits of a dead saint—teeth, fingerbones, bits of hair. Enough to reconstruct the entire saint if assembled.</li><li>Exotic hats.</li><li>Dried, pressed flowers.</li><li>Deep-sea fish, squid, jellyfish and worms, all in jars of slightly yellow-tinted preservative.</li><li>Spiders pinned to cards, their webs encased in blocks of glass.</li><li>Interesting shoes.</li><li>Surgical tools through the ages.</li><li>Ancient pottery and glassware.</li><li>Glass eyes.</li><li>Candlesticks and lamps.</li><li>Ancient coins.</li><li>Signet rings of various noble houses, from exotic lands or the distant past.</li><li>Fabulous masks.</li><li>Paraphernalia for consuming narcotics.</li><li>Prosthetic limbs.</li><li>Vials of blood from various animals.</li><li>Samples of strange rocks and minerals.</li><li>Exotic herbs and spices. </li></ol><p>Anything on display is either very old, very rare, or from very far away; possibly even all three. As a result, if taken and sold to a collector in the real world, the items on display are worth at least 100 silver multiplied by the display’s Depth.</p>"
    },
    {
      "title": "Ink Vats",
      "description": "<p>Large brass vats of ink, the tops open to the air, stirred slowly by a clockwork whisk that hangs from the ceiling. Five vats total, containing black, red, green, blue and infernal ink. On the sides of each vat is a tap, labelled, that allows you to refill an inkwell or bottle from the vat.</p><ul><li>The black ink is mundane.</li><li>The red ink stings when touched: anything written with it on flesh appears as if it were a birthmark or scar. </li><li>The green ink permanently stains anything it touches, and can never be washed off. </li><li>The blue ink is invisible during the daytime.</li><li>The infernal ink can be used to write infernal contracts. Any contract written in this ink is magically binding. Every signatory on the contract instinctively knows if anybody else has broken the contract as soon as it happens. </li></ul><p>1-in-6 chance that any encounter here will be with an Ink Elemental oozing out of the vats.</p>"
    },
    {
      "title": "Map Gallery",
      "description": "<p>A number of maps on the walls, in picture frames. Some depict familiar lands. Others, more exotic places such as Carcosa, Leng, Ynn or Laputa. There’s a 1-in-6 chance that there’s a map of any particular exotic country that the PCs might wish to explore in the future or have visited in the past.</p><p>If the PCs are looking for information about an exotic location, observing the Map Gallery for a turn will give them clues: they add 2 to their Progress Score. </p>"
    },
    {
      "title": "Boiler Room",
      "description": "<p>A room devoid of bookshelves. Against one wall, a huge black-iron furnace, over which a tank of water boils. Large pipes channel the steam elsewhere in the Library. If the boiler itself is broken (which will take some skilled sabotage, or 20 damage in one go), it ruptures and bursts, dealing 4d6 damage to all in the room.</p><p>Steam vents on the front of the boiler or the pipes that snake away from it can be damaged or released: the blast of steam that issues deals d6 damage. Damage to the steam pipes has a similar result.Save vs Dragon Breath for half damage.</p>"
    },
    {
      "title": "Auditorium",
      "description": "<p>A large room empty of bookshelves, semi-circular in shape. In the middle of the flat side, there is a small stage with a desk and behind it a large blackboard. Around this in half-circles are rings of benches, each row a few feet higher than the one in front.</p>"
    },
    {
      "title": "Skeleton Collection",
      "description": "<p>Around a dozen skeletons in glass cases. Wired into position. Labelled neatly. Roll a d10 for what skeletons there are:</p><ol><li>Babies.</li><li>Children.</li><li>Human adults.</li><li>Human mutants.</li><li>Birds.</li><li>Snakes.</li><li>Long-extinct monsters.</li><li>Fish.</li><li>Giants.</li><li>Apes.</li></ol>"
    },
    {
      "title": "Chapel",
      "description": "<p>A long room supposedly dedicated to religious devotion. A high arched ceiling, supported by pillars. Rows of pews, and at the front a pulpit before the altar. The pulpit has a small lectern built in with an Extraordinary Book resting on it. Roll on the Extraordinary Books Table. </p><p>The altar is a simple affair, with the suitable trappings of a common faith—maybe a crucifix and candles, perhaps a bowl and sacrificial knife, depending on the religion. Under the altar, there are a few stored trinkets. Roll on the Treasure Table.</p>"
    },
    {
      "title": "Tea-Room",
      "description": "<p>A small, well furnished room. Comfortable chairs, low tables. Cozy. To one side, there’s tables against the wall with food and drink, and the chinaware and cutlery required. Roll d10 three times for what:</p><ol><li>Scones, jam and cream.</li><li>Cake.</li><li>Sandwiches.</li><li>Port and sherry.</li><li>Cheese and biscuits.</li><li>Tea.</li><li>Cocktails.</li><li>Coffee.</li><li>Fried breakfasts.</li><li>Pastries, croissants, etc.</li></ol><p>Every time the party visits the room, re-roll what food is present; Red Librarians restock the room periodically.</p>"
    },
    {
      "title": "Statuary",
      "description": "<p>A long gallery, filled with several dozen statues on pedestals. Each life-size. Most reclining, seated or otherwise relaxed. Each worth 300 silver multiplied by the room’s Depth; being a life-sized statue, getting one out will be tricky.</p><p>If the party is looking for a specific person, 50% chance there’s a statue of them here. Any corpse brought here slowly turns to stone over the course of a turn. Anybody sleeping or unconscious here likewise turns to stone after a night-cycle’s worth of sleep.</p><p>The statues all have a neat brass plate on their pedestal, detailing the subject. If looking for information about a historical figure, 50% chance there’s a statue of them here; if so, increase the Progress Score by 1.</p>"
    },
    {
      "title": "Stuffed Animals",
      "description": "<p>A gallery full of taxidermied animals, displayed alongside detailed information. The animals are all interesting in some way: rare, foreign, extinct, mythical.</p><p>If looking for information about a particular type of animal or legendary beast, 50% chance there’s a taxidermied example here. If so, increase the Progress Score by 1.</p>"
    },
    {
      "title": "Mausoleum",
      "description": "<p>Among the bookshelves, a large stone sarcophagus. A rectangular block of stone, carved into rococo flutes and scrolls. The top has an inscription, and can be lifted up. Within, there is a skeletal corpse. Roll twice on the Treasure Table to see what was interred with them.</p>"
    },
    {
      "title": "Storage Vault",
      "description": "<p>Behind a closed, locked door, the material treasures of the Library are stored. The door’s lock will need to be picked, or the door broken down, to get in. Within, there’s a wealth of materials in marked cases.</p><p>Roll twice on the Treasure Table  for items of particular interest that are here. In addition, there are rare materials—pigments, silk, semiprecious stones, etc—worth 100 silver multiplied by the Depth of the room.</p><p>Lastly, roll d20 three times to see what mundane materials are stored here:</p><ol><li>Sheaves of blank paper.</li><li>Janitorial equipment.</li><li>Sealing wax.</li><li>Unused furniture. </li><li>Woodworking tools.</li><li>Empty glass globes and bottles.</li><li>Candles.</li><li>Sawdust.</li><li>Ladders.</li><li>Paint and brushes.</li><li>The hooded monastic robes of the Librarians.</li><li>Barrels full of human teeth.</li><li>Dyed leather.</li><li>Salt.</li><li>Glass tubes.</li><li>Pens and stationery.</li><li>Metalworking tools.</li><li>Books that need repairing.</li><li>Books that need replacing.</li><li>Vats of ice.</li></ol>"
    },
    {
      "title": "Planetarium",
      "description": "<p>A high, domed ceiling, onto which lanterns project dots of light that resemble alien constellations. In the centre of the room, a large clockwork orrery modelling the solar system. A lamp burning in the centre, and long arms that hold model planets, moons and comets in place. The whole thing clicks and grinds as it slowly turns.</p><p>The planetarium moves to accurately represent the position of the celestial bodies outside in the real world. It can, however, be manually reset to a past or future position of the celestial bodies.</p><p>Bookshelves at ground level contain information on astronomy and astrology. Anybody who uses the planetarium to cast an astrological horoscope for the subject of information they are seeking adds d6 to their Progress Score. Furthermore, if they roll a d20 under their Intelligence, they may ask a single yes-or-no question about the subject of the horoscope and get an accurate answer.</p><p>Lastly, resetting the position of the orrery has a distorting effect on the time-stream. Those present find their state reset to the time shown on the orrery. If they set it to a point in the past, then the consequences of events after that point are negated for those present—injuries disappear, curses were never bestowed, healing never happened, etc. Likewise, if set forwards, then any healing, ageing, disease, etc. that might happen in the time set forward occurs immediately. The time-stream for the rest of the world remains unaffected; only the PCs party skips back or forward in time.</p><p>The orrery can go forward or backwards in increments of one round, turn, hour, day, week, month, year or century.</p>"
    },
    {
      "title": "Calculation Engine",
      "description": "<p>The shelves give way to a huge machine made of clockwork and steam pumps. Incredibly complex, the machine hisses, creaks, clicks, and turns. There is a terminal in the front-centre of the Calculation Engine. Tiles that can be pushed, marked with letters A-Z, numbers 0-9, and punctuation. Above the tiles, there is a slot from which emerges a long ribbon of paper that winds down into a pile on the floor, like ticker-tape. A mechanical pen writes onto the paper ribbon as it’s extruded.</p><p>It is, effectively, a mechanical computer, using gears and valves rather than electrical components. It is only one part of a much greater whole that lies in a huge network spread throughout the library.</p><p>Pushing a tile results in a series of clicks, and new wheels within the machine starting to turn. You can type things into the engine using these tiles. Anything the players type in is put into the Calculation Engine. The output will be written on the paper ribbon, extruded out into the pile. The players can read the response, which will vary depending on what input they used. Go down the list in the next column, starting at the top, and use the first response that applies to their input.</p><p>If the players input a fact that is known to be true (which is to say, correctly recorded as factual in any book anywhere in the world), the response is: </p><p><code>###Data Confirmed###</code></p><p>If the players input a fact that is known to be false (which is to say, correctly refuted in any book anywhere in the world), the response is:</p><p><code>###Data Contradictory###</code></p><p>If the players input a question that has an answer in any book anywhere in the world, the machine responds by naming the closest book which contains an answer. They get +1 Progress if the question asked is related to the information they are looking for. This +1 Progress applies for each related question they ask, each getting the response of a new book, until they have a list of 6 books (a total of +6 Progress). After this, the Calculation Engine begins to repeat the same books.</p><p>If the players input a question to which no answer is recorded in any book anywhere in the world, the response is:</p><p><code>###Data Not Found###</code></p><p>If the players input anything which is neither a stated fact nor a question, the response is:</p><p><code>###Unknown Input###</code><code>###Recalibrating###</code></p><p>The Calculation Engine is attended to by d4 Grey Librarians at all times. If they are slain or removed, more will arrive within a turn.</p>"
    },
    {
      "title": "Phantom Databanks",
      "description": "<p>The room contains a set of shelves against one wall. Each shelf holds a row of glass jars. Each jar has a set of wires emerging from it, linking it to a small machine at the end of each shelf that displays the pressure, temperature, emotional state and acidity of each jar’s contents on a set of dials. There are 30 jars in total. 24 contain a phantom, the rest are currently empty. Each phantom appears as a condensed mist, thrashing wildly, flickering with colours and patterns, glowing slightly. </p><p>Opening a jar releases the contained phantom. It doesn’t really want things or have a sense of self, but it is compressed unnaturally in the jar, and will expand to its full size (about that of a human) when released. A newly released phantom is agitated and energetic. Whilst it does not have enough awareness of its surroundings to attack, it will almost certainly cause problems.</p><p>Alternatively, a phantom in a jar can be used as a dim source of light, illuminating out to a five-foot radius. </p>"
    },
    {
      "title": "Spider Trapdoor",
      "description": "<p>Under the floor of this location, there lurks a huge spider, an ambush-predator adapted to the Library’s environment. It can lift up a section of floor, and emerge to grab prey, dragging it down to feed. It’s burrow is just big enough to fit itself, and a few prey (either bundled up ready to eat, or still being subdued).</p><p>When the players first enter this location, describe the floorboards as being a little uneven, and that there are strands of cobweb over the floor. This is the only clue they get. If they test the floor, tell them there is a hollow space beneath. If they don’t think to check, it’s their own fault when they get ambushed.</p><p>The spider can sense the footsteps of those walking above it as vibrations and sound. It knows how many are present, if any are injured, and how heavy they all are. From this, it can make a good guess as to who makes the best victim. Typically, this will be whoever is bringing up the rear. Sometimes, it waits for a group of victims to disperse to explore the room, and grabs somebody who stands over its pit undefended.</p><p>When the spider makes its move, a section of floorboards lift up, and its front half (face and front legs) emerges from beneath. It grabs its victim and tries to drag them into its pit, closing the lid behind it. </p><p>It makes a single surprise attack. If the attack hits, the victim is pulled into the spider’s pit and takes damage. Furthermore, there is a 3-in-6 chance that the spider does this quietly enough that (unless the victim states that they cry out) nobody notices it has happened unless they’re looking at the victim. </p><p>Inside the spider’s pit, there are various valuables taken from its previous victims. Roll on the Treasure Table.</p><p><strong>Trapdoor Spider</strong>: <em>HD 4, 16 HP, Armour as chain, Bite (+4, d10 damage and Save vs Poison), Save as Fighter 4.</em></p><p>3-in-6 chance to make no noise at all when it does something. If a victim fails their Save vs the spider’s venom, they are paralysed for a turn.</p>"
    },
    {
      "title": "Printing Machine",
      "description": "<p>A large, steam-powered printing press, its operation automated. It is plumbed into the larger structure of the Library, powered by high-pressure steam piped in from the boilers. It produces replacement pages, important paperwork, etc., which slide from the printing press and into collection baskets. It creaks, clatters and grinds as it works. It’s in constant motion, and the piles of paper it produces build up over time.</p>"
    },
    {
      "title": "Ossuary",
      "description": "<p>A collection of bones packed Tetris-style into six glass-fronted display cases. Each neatly labelled with who it was taken from, when it was taken, the circumstances of their death, and what killed them. </p><p>Of the bones present, only a handful are from somebody interesting enough to be of value. There are d4 interesting bones in each case, each bone worth 10 silver multiplied by the location’s Depth.</p><p>Trying to remove the bones requires smashing open or unlocking the display cases. This releases the Bone Beast within: an animated swarm of bones of indistinct formation that behaves like a cross between a swarm of hornets and a small landslide. Just hundreds of bones all battering whoever tried to steal from them. Once the Bone Beast is defeated, the party can take the valuable bones from that cabinet.</p><p><strong>Bone Beast</strong>: <em>HD 6, HP 12, Armour as leather, Batter every nearby victim (hits automatically, d4 damage), Save as Fighter 6.</em></p><p>Swarm form reduces most physical damage to 1, but area attacks do double damage. Undead, with all the vulnerabilities and immunities that implies. Cannot be backstabbed (due to lack of vulnerable anatomy).</p>"
    },
    {
      "title": "Syphon of Phantoms",
      "description": "<p>In the centre of this room is a hollow metal cone, narrow at its base and broad at the top, riddled with holes the size of a finger. The whole thing is like a huge sea-sponge or coral made of etched metal.</p><p>The hollow space within the conical Syphon is filled with glass vials. Some are empty, some contain condensed phantoms like a wriggling turquoise mist. Thin glass tubes and wires link the vials to one another and to the exposed plumbing of the Library, like some huge alchemist’s distillery.</p><p>Whenever somebody dies in the Library, their soul is inexorably drawn towards the Syphon. While they may only drift a few feet closer each day, the Syphon acts like the nearly inescapable gravity well of a black hole in the spiritual plane. A few souls, not yet converted to phantoms, can be seen hanging in the air as dim shimmers, oozing closer to the Syphon, inch-by-inch.</p><p>A soul sucked into the syphon is drawn through its various channels and tubes, compressed and distorted and rendered down by the process until only a phantom remains. Once this process is complete (which takes a few minutes) the machine gives a cheerful “DING!” and another glass vial is filled with the new phantom.</p><p>The room’s thanatropic machinery constantly tugs at your soul. Death comes easily here. Whenever damage is taken in this room, the Syphon deals 1 additional damage the next round as it attempts to pull vulnerable souls free of their fleshy homes.</p>"
    },
    {
      "title": "Steam Vents",
      "description": "<p>Here, the steam pipes that thread through the Library are exposed. A large valve is set into the wall that can be opened or closed by turning a huge wheel. If the valve is opened, the steam from the pipes vents into the room, dealing d6 damage to everybody present as it scalds them and filling the room with blinding fog.</p><p>Even if the vents aren’t fully opened, smaller pressure valves constantly release little bursts of steam into the room. The air is humid, hot, and thick with mist, allowing those present to re-roll failed rolls to hide in the mist.</p><p>Because of the damp air, the books here are all protected by a thin layer of wax, or else etched into paper-thin sheets of metal. Bringing in normal paper books ruins them rapidly.</p>"
    },
    {
      "title": "Paper Beehive",
      "description": "<p>The room here is infested with vermin: bees the size of a human hand. They built a hive against one wall out of papier-mâché, layers of pages built up into a blister-like nest twelve feet across that stretches from floor to ceiling.</p><p>Although the entrances the bees use are only a few inches across, you can get into the beehive pretty easily, simply by cutting through its paper walls. Within, chambers the size of a human head contain eggs, larvae, dormant bees, and the Black Honey that the bees make. If the entire hive is ransacked, there are 6 pints of Black Honey inside.</p><p>Black Honey is made without flowers. Instead, the bees harvest ink from open books and blood from corpses. Over time, the bees condense and refine the Honey, producing a substance dense with magical potential. Roll a d8 for anybody who consumes a mouthful of it to see what changes it works upon them:</p><ol><li>The consumer can speak to and understand any insects, mundane or otherwise.</li><li>The consumer can see into the ultraviolet spectrum, allowing them to see through most camouflage and to perceive electrical charges by the ultraviolet glow they produce.</li><li>The consumer’s skeleton becomes brittle. -2 maximum HP permanently, to a minimum of 1.</li><li>Subtle yellow-and-black bands appear on the consumer’s skin.</li><li>The consumer sprouts a stinger over the course of the next few days. It can be used once as a weapon, doing 2d12 damage to both the victim and the consumer (as the sting is wrenched free, bringing their viscera with it).</li><li>The consumer’s body becomes light and filled with hollow spaces. Halve all falling damage.</li><li>The consumer sprouts two pairs of transparent wings from their shoulder blades, allowing them to hover a few feet above the floor.</li><li>The consumer’s skin hardens into a brittle exoskeleton. +1 AC.</li></ol><p>There are 20 mouthfuls of honey in the hive.</p><p>There are 2d6 bees on guard in the room. So long as the PCs don’t harm the guard bees or their hive, the bees will ignore them. If a fight starts, d8 bees emerge from the hive each round. The first time an 8 is rolled, then 8 bees emerge and their Queen comes with them. There are 120 bees and their Queen in total.</p><p><strong>Bee</strong>: <em>HD 1, HP 3, Armour as leather, Sting (+1, d8 damage to the bee and its victim), Save as Fighter 1.</em></p><p><strong>Queen Bee</strong>: <em>HD 4, HP 12, Armour as leather, Sting (+4, d8 damage to the bee and its victim), Save as Fighter 4.</em></p>"
    },
    {
      "title": "Furnace",
      "description": "<p>A metal chamber filled with coal burns fiercely, its heat used elsewhere to power steam engines or warm the Library. Opening the shutters to the furnace produces a blast of hot air that deals d6 damage to those directly in front of it. Actually going inside the furnace does 4d6 damage a round.</p>"
    },
    {
      "title": "Holding Pen",
      "description": "<p>Within this room is a huge glass vat, like a fish tank. Copper tubes connect it to the rest of the Library’s plumbing. A single brass hatch is set in one side; it can be opened from the outside but not from within. The hatch is locked.</p><p>Within, there are d10 phantoms hanging like oily smears in the air. If the PCs seek the soul of a specific person, there’s a 1-in-10 chance that one of the phantoms encountered here is that soul.</p><p>Each turn either d4 more phantoms arrive in the pen, deposited by the tubes, or d4 are sucked out into the library’s plumbing. There’s a 50% chance that the first encounter here will be with d6 White Librarians.</p>"
    },
    {
      "title": "Phantom Pumps",
      "description": "<p>A huge steam-powered machine is built into the wall of this room, made of black iron, all tubes and pistons and valves. It serves to pump phantoms around the Library to where they’re needed. The whole contraption clanks and groans constantly as it moves.</p><p>There’s a control panel nearby, with various dials, switches and levers to control what phantoms the pumps send where. A single White Librarian is here, manning the controls.</p>"
    },
    {
      "title": "Infernal Gateway",
      "description": "<p>This room contains a single huge horrible doorway in addition to the normal exits. Made of gnarled dark wood set into a stone frame, with black iron hinges and a sturdy lock. The whole thing—door, frame and lock—is engraved with the sort of horrible sigils that hurt to look at for too long.</p><p>The doorway leads to Hell. </p><p>Each turn, there is a chance that a minor Devil will come through the doorway. This chance depends on how depraved the PCs are (sin attracts the Devils): check the list of sins below for the chance.</p><ul><li>Trespassing into another’s home, petty theft and other minor crimes: 1-in-6 chance.</li><li>Serious theft, such as armed robbery, grave-robbing, extortion, etc: 2-in-6 chance.</li><li>Unnecessary violence or mayhem such as arson, pointlessly attacking people, or acts designed to outrage the public: 3-in-6 chance.</li><li>Murder: 4-in-6 chance.</li><li>Wilful sadism and cruelty, such as torture, murder out of spite, etc.:5-in-6 chance.</li></ul><p>If a Devil shows up, it has the following basic statistics:<em>HD 2d4, HP 2 per HD, Armour as chain, Whip/claws/pitchfork/flensing knife (bonus to-hit same as HD, d8 damage), Save as Fighter of equal HD.</em></p><p><em>Halve damage not from holy, magical, or silver weapons. Double damage from holy sources. Immune to mind-control that doesn’t specifically target infernal beings.</em></p><p>Roll a d6, d8 and d10 for its specifics.</p><p>The d6 determines its appearance. It is:</p><ol><li>Angelic.</li><li>A goat-human hybrid.</li><li>A bat-human hybrid.</li><li>Serpentine.</li><li>Corpselike.</li><li>Perfectly human-looking other than tiny horns.</li></ol><p>The d8 determines its role in the infernal hierarchy. It is:</p><ol><li>A thrall.</li><li>A lawyer.</li><li>A librarian.</li><li>A jailer.</li><li>A torturer.</li><li>A tempter of mortals.</li><li>A financier.</li><li>A diplomat to other realms.</li></ol><p>The d10 determines a special ability the Devil possesses.</p><ol><li>Can turn any inanimate object to solid gold by touching it.</li><li>Can grant a single wish in exchange for a mortal’s soul upon death.</li><li>Can transform into a cloud of flies.</li><li>Can transform into a harmless-looking animal.</li><li>Can mimic the appearance of the viewer’s loved ones.</li><li>Touch drains memory (d12 damage to intelligence).</li><li>Can teleport short distances in a puff of smoke.</li><li>Can locate the soul of a specified individual unerringly.</li><li>Immune to fire.</li><li>Casts <em>Charm Person</em> when it shakes your hand.</li></ol><p>The Devil wants you to damn yourself. It will seem helpful until you anger it. Everything it offers has an unforeseen price.</p>"
    },
    {
      "title": "Jarred Brains",
      "description": "<p>The shelves here are lined with glass jars, each filled with a clear fluid. An intact human brain floats in the fluid, with wires linking where the spinal column would be to a small mechanism set in the jar’s base. Each jar is labelled to say whose brain it contains, and when they were interred.</p><p>Each jar’s fluid is a nutrient solution designed to keep the brain within alive. Occasionally, a bubble rises to the surface as the jar’s mechanisms keep the fluid oxygenated. The mechanism links to a small metal grille in the front of the jar; this is how the brain within communicates in a tinny, staticky voice. The brains are torpid and dormant as the PCs enter, but can be roused by shaking their jars or speaking directly into the grille at the front of their jar, for example.</p><p>Of the brains present, at least one will be an intellectual figure (recent or historical) known to the PCs. There’s a 1-in-4 chance that it’s somebody directly connected to the subject of the PCs’ research. Conversing with this figure might answer all sorts of questions, and adds 4 to the party’s Progress Score if their area of knowledge is relevant. Being stuck in a jar has almost certainly given the brain a long time to spend in self-reflection with little external stimulus. It has no doubt become deeply strange in its outlook and priorities.</p><p>The remaining brains are split roughly evenly between those incapable of intelligible communication due to language barriers, those incapable of intelligible communication due to total jar-induced madness, those unable to be roused from their torpor, and those with little worth saying.</p><p>A Jarred Brain exists in a weird state halfway between life and death. It is affected just as easily by magic that affects the living, the dead and the undead. 1-in-4 encounters here will always be with Floating Brains.</p>"
    },
    {
      "title": "Dissection Theatre",
      "description": "<p>A surgical table sits in the centre of this room, illuminated by bright lights and surrounded by seating for spectators. This is a space where researchers can take apart bodies (alive or dead) to see what’s inside them. Sometimes there’s an audience when this happens, but there’s always a Grey Librarian taking notes.</p><p>Roll a d4 for who’s present when the PCs arrive:</p><ol><li>Nobody.</li><li>A pair of black librarians preparing for or cleaning up after a dissection.</li><li>A Neurovore performing a dissection, watched by 2d4 Visitors and a Grey Librarian.</li><li>An Archivist-Lich performing a dissection, observed only by a Grey Librarian.</li></ol><p>Roll a d12 for what’s being dissected: </p><ol><li>A human baby.</li><li>A monkey.</li><li>A large spider.</li><li>A pregnant ape.</li><li>An injured human youth.</li><li>An elderly human.</li><li>A goat.</li><li>A large shark.</li><li>The egg of a huge serpent.</li><li>A vampire, staked to keep it dormant.</li><li>A lobotomized elf.</li><li>An octopus.</li></ol><p>There’s a 1-in-4 chance the subject is still alive.</p>"
    },
    {
      "title": "Mummy Vault",
      "description": "<p>This is where dead Librarians go. Each is dried out, treated with the same chemicals used to preserve the books, and wrapped in a tight shroud. The shelves are packed with little corpses swaddled up in off-white grave cloths. It smells of natron and vinegar. The dead Librarians won’t rise, ever. </p>"
    },
    {
      "title": "Sheol Computer",
      "description": "<p>The Sheol Computer is the heart of the Library, the vast machine whose calculation drives everything else that happens here. The computer fills the entire room. It’s mostly a tangle of thin glass tubes and valves through which phantoms flow like electricity through a computer’s circuit-boards. Other more odd components are present, though. </p><p>There are a few each of:</p><ul><li>Clockwork engines that tick up the count of souls in the machine.</li><li>Human brains wired into the computer.</li><li>Collections of dials and displays, allowing the White Librarians to monitor the computer’s workings.</li></ul><p>There’s also one each of the following components:</p><ul><li>A huge canvas screen with text projected onto it that reflects what the computer is currently working on. The text flickers and scrolls past almost too fast to make out.</li><li>A keyboard, with the letters A-Z, numbers 0-9, and punctuation, which can be used to input text into the computer. If text is input with the keyboard, it appears on the screen, followed by the computer’s response.</li></ul><p>The possible inputs and responses are: </p><ul><li>All of those for a Calculation Engine.</li></ul><p>And also:</p><ul><li>If the players include a dead person’s name in their input, the computer will state their date and cause of death.</li><li>If the players include a living person’s name in their input, the computer will state their most likely cause of death and then:</li></ul><p><code>###Date Unknown###</code></p><ul><li>For PCs, pick a cause of death that is most likely for that PC. The character takes maximum damage from that danger, always fails all Saves against it, is always the first affected by it, etc.</li><li>If the players include the name of a deity, demon, angel, fairy or other immortal being in their input, the computer will list the date of their death as the accurate date of the end of the world, and the cause as ‘Armageddon’.</li><li>If the players ask about the purpose of the Library or the Sheol Computer, it simply answers:</li></ul><p><code>###Entropic Transcendence.###</code></p><p>D8 White Librarians attend to the Sheol Computer at all times. Damaging the Computer earns the enmity of all Librarians, forever.</p>"
    }
  ],
  "details": [
    {
      "title": "Empty",
      "description": "<p>The shelves are bare, and there is no furniture or fittings. The place is totally empty.</p>"
    },
    {
      "title": "Treasure-pile",
      "description": "<p>On one shelf, a little stack of treasure. 3d6x10 gold coins in various denominations, and roll twice on the Treasure Table.</p>"
    },
    {
      "title": "Notes",
      "description": "<p>A previous visitor has written something. Perhaps it’s a note pinned to the shelves or a little chapbook to collect their observations.</p><p>If there’s some threat present, the graffiti warns about it. If there’s something valuable that could be salvaged, the graffiti points it out. Roll a d20 three times for what else the graffiti says—each piece is in a different hand.</p><ol><li>“The Librarians come in five types: avoid the Grey ones, bold visitor.” (True, and good advice.)</li><li>“They tried to steal our souls!”</li><li>“We came in near here, look for the doorway out.”</li><li>“[Robilar/Angry Fran/Baz &amp; Dave/Ser Jaime/Black Elsie] Was Here.”</li><li>“The bodiless ghosts are mostly harmless if you leave them alone.”</li><li>“Spiders lurk beneath the floor!”</li><li>“The astrolabe lets you control Time Itself!” (Basically true.)</li><li>“I have forgotten something. I don’t know what. If I try to remember, I convulse and black out. If you start forgetting, flee or it will happen to you too.”</li><li>“I put it back! Don’t hurt me! Don’t turn me into one of THEM!”</li><li>“I Hate Ghosts.”</li><li>“I left the index here.” (It’s long gone.)</li><li>“This should be obvious, but don’t trust the Devils, they screwed me and they’ll screw you too.”</li><li>“The Brains and the Brain-Eaters are both at war with the Librarians. And each other.”</li><li>“Deeper in, there are more doors leading to other places!”</li><li>“You can get to Hell from here. Can you come here from Hell? Could this place let you escape Death Itself?”</li><li>“For crying out loud, don’t set anything on fire.”</li><li>“Beware the Bandersnatch, my friend! Just give it what it wants, or kill it like any other fairy.”</li><li>“The ink is alive! It’s everywhere, watching and waiting! Is civilization doomed?” (Civilization will be fine.)</li><li>“I met Lady Macbeth. Like in the play. It was very weird, but if you play by her rules you’re safe.”</li><li>“This place is evil. It should be burned and destroyed.” (An understandable sentiment.)</li></ol>"
    },
    {
      "title": "Oriental Rug",
      "description": "<p>A huge Persian rug lies across the floor, ornate in its pattern and probably over a century old. Worth 50 silver multiplied by the Depth of the location.</p>"
    },
    {
      "title": "Candles",
      "description": "<p>Candles stuck onto the tops of the bookshelves, and on every table. Old, fat, dribbly. Once-molten wax pools and cracks on the floor and forms glossy white speleothems on the walls. Needless to say, the room is well-lit.</p>"
    },
    {
      "title": "Webs",
      "description": "<p>The place is thick with cobwebs, stretching across the corridors and over the books themselves. Getting through, or getting to the books, is perfectly easy, since the webs break as soon as you push through them, but it’s a little unpleasant nonetheless. The first encounter here is always with several mundane, harmless spiders.</p>"
    },
    {
      "title": "Fireplace",
      "description": "<p>The location is lit by a roaring fire in a grate, with a bucket of coal nearby, and tongs, pokers, etc. Where the chimney opens out, it&#39;s impossible to say; you’d get stuck or die from smoke inhalation long before you escaped. </p><p>However, if more than one location has been generated with a fireplace, you can use the chimneys to travel between them. Climb into the chimney of one, and you can climb out of the chimney of the other. If the PCs try this before a second such location is generated, instead it links to a new location with a fireplace; roll a d12 for Depth and then roll the location randomly.</p>"
    },
    {
      "title": "Lamp-post",
      "description": "<p>An iron lamp-post bolted to the floorboards, with a lamp at the top that illuminates the shelves nearby.</p>"
    },
    {
      "title": "Gas Lamps",
      "description": "<p>The location is lit by a number of gas lamps fixed to the walls, fed gas by delicate copper pipes that run along the skirting-boards. If the gas is let out into the room, it will explode if lit, dealing 3d6 damage to everybody present (Save vs Breath for half damage).</p>"
    },
    {
      "title": "Glass Tubes",
      "description": "<p>The room is criss-crossed with glass tubes fastened to the ceiling and walls, and that snake over the tops of the shelves. Roll a d8 twice for what the tubes carry:</p><ol><li>Ink.</li><li>Steam.</li><li>Molten wax.</li><li>Gas, for lamps, etc.</li><li>Hot water.</li><li>Petrol.</li><li>Brandy.</li><li>Pressurized air.</li></ol>"
    },
    {
      "title": "Staircase",
      "description": "<p>The location is built not on a flat floor but on the sides of a long spiral staircase that goes down several hundred feet. The PCs always enter at the top. Anybody falling down the stairs takes d6 damage for every 20 feet fallen. Roll to hit to push somebody down the stairs; they Save vs Paralysis to avoid falling.</p>"
    },
    {
      "title": "Candle-sticks",
      "description": "<p>The location is lit by candles in big three-pronged candlesticks that can be picked up and carried about.</p>"
    },
    {
      "title": "Portcullis",
      "description": "<p>The location lies behind a huge portcullis that must be broken down or have the lock picked. Cunning or strange solutions could be found—if the party can’t get through, they must go back to the previous location.</p><p>By way of temptation, roll on the Treasure Table for what can be glimpsed on the other side of the portcullis.</p>"
    },
    {
      "title": "Scrolls",
      "description": "<p>Rather than books, the shelves here hold scrolls rolled neatly and fit into tubular cases.</p>"
    },
    {
      "title": "Funeral Urns",
      "description": "<p>Each shelf ends with a china urn containing the ashes of a former visitor to the Library, labelled with their name and the date of their death. If the PCs are looking for a specific person, there’s a 1-in-10 chance that one of the urns contains their remains (or at least claims to).</p>"
    },
    {
      "title": "Turning Gears",
      "description": "<p>An array of clockwork gears affixed to one wall—some delicate and as small as a thumbtack,some as big as a cartwheel, and all manner somewhere in between—which interlink and turn slowly with an irregular ticking sound. The gears link into a greater mechanism below the floor or above the ceiling. Getting pushed into the gears, or sticking part of yourself in, deals 2d6 damage. </p>"
    },
    {
      "title": "Vault",
      "description": "<p>The location is within a locked vault, behind a strong iron door. A neat sign above the door summarizes the contents of the vault. To get in, you’ll need to open the door by picking the lock or by some other cunning method; brute force might work, but the chances of success are halved. Once PCs gain access to the vault, they can go deeper by leaving it again and continuing down the corridor.</p>"
    },
    {
      "title": "Chained Books",
      "description": "<p>The books here are all chained to the shelves—perhaps to prevent theft, or perhaps to prevent them escaping, depending on the nature of the books.</p>"
    },
    {
      "title": "Too Small",
      "description": "<p>The room is sized for people one-third the size of humans. The ceiling is only four feet high and the books, furniture and similar things are likewise smaller. To explore, the PCs (other than children, halflings, etc.) must crawl between the cramped shelves.</p><p>Things encountered within are sized appropriately, but keep the same stats: the exception is any visitors from outside the Library, who are too big for the location.</p>"
    },
    {
      "title": "Phosphorescent Lamps",
      "description": "<p>The room is lit by a number of glass orbs suspended from the ceiling, each of which gives off a soft, blue-green glow. The atmosphere is relaxed and cool.</p>"
    },
    {
      "title": "Stacked Papers",
      "description": "<p>Rather than books, the shelves hold stacks of loose papers—mostly forms and documents, formed into piles and tied into blocks with string.</p>"
    },
    {
      "title": "Negligible Gravity",
      "description": "<p>Gravity’s effect is drastically reduced here, much like on the moon. Things drift downwards rather than falling. Nobody ever suffers damage from falling or having things fall on them. Creatures can jump to great heights and long distances; five times further than normal. Shooting has a -3 penalty to hit (except at point-blank range or with firearms).</p>"
    },
    {
      "title": "Silent",
      "description": "<p>It’s stereotypical for a library, but an air of total silence hangs over the room. Speech is inaudible, and even the loudest noises are barely more than a whisper. Needless to say, this has a number of benefits for entities wishing to be stealthy, but means that the incantations to cast spells are impossible.</p><p>A spellcaster who tries casting by shouting at the top of their lungs might succeed if they pass a Strength roll (their shouted spell is as loud as a handkerchief hitting the ground). If they fail the roll, they only succeed in damaging their vocal chords—if they have more than 1 HP left, they take 1 damage.</p>"
    },
    {
      "title": "Letters",
      "description": "<p>Rather than books, the location’s shelves hold stacks of letters, most still in their envelopes. There’s a 1-in-4 chance that, if the PCs are looking for information about a famous person known for their correspondence, there’s a letter addressed to them or written by them present (+1 Progress). If there is, there’s a 1-in-6 chance they can find the reply, and then 1-in-8 they can find the reply to that, etc. +1 Progress for each such letter found.</p>"
    },
    {
      "title": "Spirit Illumination",
      "description": "<p>The room is lit by an ingenious, if subtly disturbing, method. Around the room are glass orbs, each containing a phantom. Each orb is held in a clockwork device which, every few minutes, shakes the orb gently, agitating the phantom within and causing it to produce pulses of light to express its irritation. The room is, therefore, lit by a constantly shifting and flickering glow of different colours that rises and falls as the different phantoms are given a good shake periodically.</p>"
    },
    {
      "title": "Too Large",
      "description": "<p>The room is sized for beings twice the size of humans. The ceiling is 30 feet high, and all the books, furniture, etc., are sized for 12-foot-tall people. Any creatures encountered in here (except for those who are also visitors) are likewise double-sized, but keep the same stats.</p>"
    },
    {
      "title": "Haunted",
      "description": "<p>The room contains the echoes of a long dead individual that has oozed into its structure and now controls the place. Roll a d6, a d8, a d10, and a pair of d12s to determine the nature of the haunting.</p><p>The d6 determines the immediately visible signs of the haunting—things that give away the fact that something is wrong:</p><ol><li>Shadows move even when the light source doesn’t.</li><li>Whispers can be heard on the edge of your hearing.</li><li>The room smells of decay.</li><li>Inky footprints and handprints appear on unattended objects and places.</li><li>The room is unnaturally cold.</li><li>There’s a sense of being watched.</li></ol><p>The d8 determines who the dead person was:</p><ol><li>A mortal librarian.</li><li>A lost child.</li><li>A nun.</li><li>A mad noblewoman.</li><li>A master burglar.</li><li>A pair of star-crossed lovers.</li><li>A plague-stricken doctor.</li><li>An emotionally tormented artist.</li></ol><p>The d10 determines what the dead person wants:</p><ol><li>Spiteful revenge on the living.</li><li>For the Location to be left alone.</li><li>To have the tale of their death returned to the mortal world.</li><li>Revenge on those they think were responsible for their death.</li><li>To harm the Library.</li><li>To protect a book (roll on the Extraordinary Book Table for which) from being removed.</li><li>To be forgotten by mortals.</li><li>To break free of the forces binding them into the Library.</li><li>To learn some arcane secret.</li><li>A proper grave.</li></ol><p>The d12s determine what the haunting can do if roused. As well as these, it can always talk in whispers to those present.</p><ol><li>Move objects about like a poltergeist. +3 to hit for d6 damage if it throws things at people.</li><li>Create illusions out of mist.</li><li>Cause wet, inky writing to appear on things.</li><li>Alter the memories of those present in minor ways. Save vs Magic to resist; a success also alerts the victim.</li><li>Cause something to catch fire for a few moments—Save vs Breath to avoid fire, or else it does d6 damage.</li><li>Cause ice to appear on things, potentially freezing them in place.</li><li>Extinguish lights and erase text.</li><li>Lock doors securely.</li><li>Speak in a loud voice.</li><li>Make vermin appear: masses of flies, cockroaches, or woodlice that attack for d6 damage.</li><li>Create gusts of wind.</li><li>Make objects collapse or fall apart. +3 to hit for d6 damage if used to attack.</li></ol>"
    },
    {
      "title": "Smoking",
      "description": "<p>The room is uncomfortably warm. Smoke seeps into the air from cracks in the floorboards, from behind furniture, and from any other crevice or gap. It’s hard to breathe. Each turn a PC spends breathing the hot, smoky air, they take 1 damage.</p>"
    },
    {
      "title": "Spirit Tubes",
      "description": "<p>The room’s ceiling has a number of glass tubes bolted to it, running the length of the room. Each tube is six inches across and contains a glowing pink mist that surges down the tube like milkshake through a drinking straw.</p><p>The tubes allow phantoms to be pumped from one part of the library to another.Breaking a tube lets out d6 phantoms immediately. Each turn thereafter, another d6 phantoms will seep out of the tube in fits and spurts until the tube is mended or blocked up.</p>"
    },
    {
      "title": "Watchful",
      "description": "<p>The room is under constant observation. Those present feel like they are constantly being scrutinized, assessed and judged. Set into the corners where wall meets ceiling, there are four dark glass orbs, each one containing a dull purple mist that swirls idly. The mist is a phantom that has been set to watch what happens in the room and remember it, so the Librarians can learn its observations.</p><p>Halve the chance of any roll to successfully hide or avoid notice in this location: it has been set up to minimize hiding spots.</p>"
    },
    {
      "title": "Morbid",
      "description": "<p>Everything here is made of human (or human-ish) remains: shelves built from slats of human bone held together through ingenious joinery, upholstery of human leather. Even the door handles are preserved human hands. </p><p>Death is a constant presence here. Small animals tend to lie down and die peacefully, and people feel an urge to drift off into dreamless sleep. Increase any damage taken here by 1. Sleeping here heals all lost HP.</p>"
    },
    {
      "title": "Time-locked",
      "description": "<p>The room is paused in time. Unless living beings make a conscious effort to move and change things, everything is in stasis. </p><p>While in the room, time does not progress: diseases and bleeding come to a halt, spells last indefinitely, sleep does not return lost HP, and so forth. Furthermore, any changes made to the room’s layout or contents reset after a turn. </p>"
    },
    {
      "title": "Semi-corporeal",
      "description": "<p>The location’s contents flicker in and out of reality, existing partially in a misty ethereal state and partly in normal physicality.</p><p>Each round, there is a 50% chance that a particular object in the room is suddenly immaterial. A shelf can be stepped through, a book falls through the holder’s hands, and so forth. Objects in the room remain solid to each other (immaterial books do not fall through immaterial shelves) and the floor, walls and ceiling remain solid at all times.</p><p>Similarly, any monsters in the room have a 50% chance each round to be immaterial—the room’s contents are also immaterial when this is the case. </p>"
    },
    {
      "title": "Doorway Out",
      "description": "<p>The room contains a doorway leading out to the real world. It is set neatly into the wall, largely incongruous but bearing a smart brass plate that states where in the real world it leads to. The location is manned by d4 Black Librarians 50% of the time.</p><p>Roll a d12 for what type of library the doorway leads to.</p><ol><li>A noble’s private collection of cultural works.</li><li>A university’s central library.</li><li>A government archive.</li><li>The collected works of a local artistic movement.</li><li>A monastery’s library.</li><li>A wizard’s arcane library.</li><li>A scientist’s collected references.</li><li>An archive connected to a public museum.</li><li>A collection of suppressed texts guarded by the church.</li><li>A cult’s hidden collection of forbidden tomes.</li><li>Administrative records.</li><li>Ancient tomes taken from an archaeological site by historians.</li></ol><p>Roll a d8 for how close to your original entrance this doorway leads.</p><ol><li>Same building.</li><li>Same town.</li><li>Same county.</li><li>Same nation.</li><li>Neighbouring nation.</li><li>Same continent.</li><li>Further afield.</li><li>Another plane of existence.</li></ol>"
    },
    {
      "title": "Tangled Passages",
      "description": "<p>This deep, all that can be found is a maze-like network of largely abandoned passageways. Dust lays over everything, and the books are so ancient as to be almost unreadable. The Librarians rarely come here.</p><p>Successfully going deeper requires navigating the abandoned labyrinth of shelves. Roll a d100 under the party’s Progress to do this. If they fail, then this is a dead end—they can only Go Back.</p>"
    }
  ],
  "events": [
    {
      "description": "Something turns up; it’s unfriendly:",
      "encounters": 1
    },
    {
      "description": "Something turns up; it’s merely curious:",
      "encounters": 1
    },
    {
      "description": "Something is disturbed while eating or reading:",
      "encounters": 1
    },
    {
      "description": "A fight or argument spills into the Location. They’re already fighting each other before the players get involved.",
      "encounters": 2
    },
    {
      "description": "Something’s territory is disturbed and it defends its lair, office, etc. If the encounter is with multiple creatures, double the amount.",
      "encounters": 1
    },
    {
      "description": "Something turns up, badly injured, totally lost or otherwise at a disadvantage:",
      "encounters": 1
    },
    {
      "description": "Something is returning to its home, office, etc., and is surprised to find the PCs here:",
      "encounters": 1
    },
    {
      "description": "An unexpected gust of wind extinguishes any exposed flames such as candles, torches etc.",
      "encounters": 0
    },
    {
      "description": "The PCs become disoriented and lose track of their position. Reduce their progress by 1.",
      "encounters": 0
    },
    {
      "description": "An ominous ticking can be heard from beneath the floorboards. Nothing happens yet. Next time an Event is rolled in this location, roll two events instead.",
      "encounters": 0
    },
    {
      "description": "Footprints, litter, research notes or other signs of passage are found. The next encounter in this location will be...",
      "encounters": 1
    },
    {
      "description": "Something’s empty home or office is found. Roll for treasure and an extraordinary book for what’s there, and the creature listed below lives here. The thing’s not home currently. Next time you’d roll an encounter in this location, instead the creature who’s home you found comes back.",
      "encounters": 1
    },
    {
      "description": "A cache of hidden treasure is found under the floorboards! Roll on the Treasure Table.",
      "encounters": 0
    },
    {
      "description": "A cache of hidden treasure is found in a chest of drawers! Roll on the Treasure Table.",
      "encounters": 0
    },
    {
      "description": "An Extraordinary Book is found on one of the shelves! Roll on the Extraordinary Books Table.",
      "encounters": 0
    },
    {
      "description": "A set of detailed notes on the Library’s layout, left by previous researchers! Add d4 to the party’s Progress.",
      "encounters": 0
    },
    {
      "description": "A bookshelf swings out from the wall to reveal a secret passage! It leads somewhere else on the map—draw a line leading to a previously explored location, ideally one less deep than the current location.",
      "encounters": 0
    },
    {
      "description": "An ominous locked door! If it can be opened (with lockpicking, force, etc.) it leads to a location d6+1 layers deeper.",
      "encounters": 0
    },
    {
      "description": "A spiral staircase behind one of the shelves! It leads back to where the PCs first entered the Library.",
      "encounters": 0
    },
    {
      "description": "Behind the party, the bookshelves rearrange themselves, blocking their route back! Erase one of the exits at this Location.",
      "encounters": 0
    }
  ],
  "visitorEncounters": [
    {
      "title": "1 Black Librarian",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain the Portals.</p><p>They can cast the following each once per turn: </p><ul><li>Hold Portal</li><li>Knock</li><li>Hold Person</li><li>Turn Mortals (as Turn Undead)</li><li>Wall of Iron</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1d6 Visitors",
      "description": "<p><strong>HD 1, HP 1, Armour as unarmoured humans, Improvised weapons (+0, d4), Save as Magic-User 1.</strong></p><p>These are harmless mortals who have wandered into the Library and are now exploring. They are wholly unprepared for the strange and terrible things they will encounter within. </p><p>Roll a d8 for who the visitors are:</p><ol><li>University students.</li><li>Schoolchildren and one teacher.</li><li>A family on an outing.</li><li>Lost government archivists.</li><li>Aspiring adventurers.</li><li>Researchers into esoteric spaces.</li><li>An occultist and acolytes.</li><li>Very lost tourists.</li></ol>"
    },
    {
      "title": "1 Giant Bookworm",
      "description": "<p><strong>HD 2, HP 11, Armour as leather, 6 tendrils (+0, paralysis for d6 rounds) or Bite (d6 damage vs helpless victim), Save as Fighter 2.</strong></p><p>This creature appears as a huge, fleshy, pallid insect larvae. A fat, segmented body, like that of a caterpillar or maggot, ends with a head studded with tiny black eyes, with six waving tendrils around its mouth. The creature is about the size of a human torso in length and thickness, the tendrils extending another foot or so.</p><p>The bookworms can chew a tunnel through wood or paper, but this is not their preferred food—they favour hunting as ambush predators. Many bookshelves and floors hide—beneath a seemingly normal surface—a network of bookworm tunnels through which the creature crawls in search of prey, bursting from its burrows to pick off vulnerable visitors to the Library.</p>"
    },
    {
      "title": "1d4 Red Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain The Library&#39;s Infrastructure.</p><p>They can cast the following each once per turn: </p><ul><li>Mending, Message</li><li>Shape Stone</li><li>Shape Wood</li><li>Spider Climb</li><li>Levitate</li><li>Create Stone</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Rust Moth",
      "description": "<p><strong>HD 1, HP 4, Armour as plate, 2 Antennae (+0, ruins a piece of metal equipment), Save as Fighter 1.</strong></p><p>Related to a wide variety of similar insectile creatures (most notably the cockroach-like Rust Monsters), these creatures feed by corroding metal into an oxidised powder that they can digest. </p><p>Rust Moths are the size of a human hand, with orange-brown bodies covered in flaky metallic scales and wings like corroded metal foil. Most noticeable are the antennae that sprout from their heads, which are their main form of attack.</p>"
    },
    {
      "title": "1 Dust Elemental",
      "description": "<p><strong>HD 5, HP 20, Armour as unarmoured, Crumbling Touch (+5, d8 damage), Save as Fighter 5.</strong></p><p>Immune to normal weapons and physical attacks. </p><p>Takes 2d6 damage per round from fire, cleaning with water, strong winds, etc. </p><p>Immune to poison, pain, fear, etc. </p><p>Can seep through any crack or gap. </p><p>Little elemental incarnations, conglomerates of dust, grit, dirt, and fluff. Like somebody scattered detritus on the ground in the rough shape of a human. It lurks under bookshelves, drifts on imperceptible drafts, and creeps forward.</p><p>The quasi-elemental nature of dust is one of things broken down, crumbling, desiccated. It is not particularly compatible with life, and the attentions of such an elemental are likely extremely unpleasant.</p>"
    },
    {
      "title": "1 Lantern-Bearer",
      "description": "<p><strong>HD 3, Hit Points 10, Armour as leather, Smack with Lantern (+3, d4) or Radiant Burst (all illuminated Save vs Magic or take 1 damage), Save as Thief 3.</strong></p><p>All invisible beings within the area illuminated by the lantern-bearer are revealed, all illusions negated while the light touches them.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p><p>A little hunched figure, no larger than a child, in a faded red robe that conceals its form entirely. It carries a lamp hooked on the end of a long metal pole that sways and bobs as the lantern-bearer shuffles through the Library on its endless patrol.</p><p>This is the fate of those thieves who try to steal from the Library, their bodies withered and their minds warped into loyal servants of the Librarians, tasked with rooting out others of their kind.</p>"
    },
    {
      "title": "1d6 Skeleton Crew",
      "description": "<p><strong>HD 1, HP 5, Armour as leather, Improvised Weapons (+1, d6), Save as Fighter 1.</strong> </p><p>All the normal undead immunities and vulnerabilities. </p><p>If injured but not killed, can use their action to put themselves back together, healing all damage.</p><p>Animated skeletons, tasked with the basic maintenance and cleaning of the Library. They wear overalls, and carry mops and brooms. They make their way through the Library slowly, washing, polishing, scrubbing and dusting as they go.</p><p>They are intelligent, and self-aware, but single-mindedly devoted to their task. If you engage with them while they work, they will happily talk with you, and prove to be well-educated and philosophical. Many of their conversations among themselves take an existential bent. It’s not clear how—without lungs or larynxes—they are able to talk at all, but this doesn’t bother them.</p><p>A conversation with the skeletons, if relevant to the information the players want, will give +1 Progress.</p>"
    },
    {
      "title": "2d6 Paper Bees",
      "description": "<p><strong>HD 1, HP 3, Armour as leather, Sting (+1, d8 damage to the Bee and its victim) Save as Fighter 1.</strong></p><p>Bees the size of a human hand that inhabit the infrequently visited corners of the Library. They feed on ink and grime rather than nectar, and distill it into Black Honey.When Paper Bees are encountered, they’ve probably got a hive not too far away. If the players decide to track where the Bees go, then after Going Deeper d4 more times, they will find a paper beehive.</p>"
    },
    {
      "title": "1 Origami Golem",
      "description": "<p><strong>HD 8, HP 28, Armour as leather, 2 slams (+8, d6), Save as Fighter 8.</strong> </p><p>Half damage from non-magical weapons. Triple damage from fire. Immune to poison, cold, backstab, etc. Mindless.</p><p>A construct made of scrap paper, glued into a rough humanoid form, folding at the joints. Flat, angular, ragged and misshapen, it shambles and limps on asymmetric limbs.</p><p>The golem is built to serve the Librarians when they need actual muscle, either in the manual labour of maintaining the library or to deal with intruders. It obeys silently. Lacking an identity of its own, its a temporary thing that serves for a time before being taken apart for materials.</p>"
    },
    {
      "title": "1d6 Yellow Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain The Books.</p><p>They can cast the following each once per turn: </p><ul><li>Mending</li><li>Message</li><li>Charm Person</li><li>Suggestion</li><li>Detect Thieves (as Detect Undead)</li><li>See Invisible</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1d4 Ogre Spiders",
      "description": "<p><strong>HD 3, HP 12, Armour as leather, Bite (+3, d6 and Save vs Poison) or Net (+3, Save vs Paralysis or be entangled and helpless), Save as Fighter 3. Can walk up walls and over ceilings. Poison does d8 damage to Dexterity.</strong> </p><p>Huge spiders the size of dogs that dwell in the ceilings and vents of the Library. They hunt in the dark, creeping above their prey before dropping their webs like a net.</p><p>An Ogre Spider’s abdomen is long and thin, resembling that of a praying mantis more than the normal, bulbous appearance of typical spiders. Meanwhile, their faces feature huge black eyes and thick maxillae that resemble a human skull.</p>"
    },
    {
      "title": "1d4 Researchers",
      "description": "<p><strong>HD 3, HP 6, Armour as unarmoured human, Improvised Weapons (+1, d4), Saves as Magic-User 3.</strong></p><p>Each Researcher can cast each of 3 spells (select them completely at random from the Magic-User or Cleric lists) once per day. </p><p>Academics who have, for whatever reason, travelled to the Library in search of lost or forbidden knowledge. Cautious, erudite and experienced, they are aware of some of the hazards they face in search of information.</p><p>Roll a d100 twice on the Types of Book Table for what they’re researching.</p><p>Roll a d8 for where they came from:</p><ol><li>University.</li><li>Noble’s private research.</li><li>Government bureaucracy.</li><li>Monastery.</li><li>Intelligence agency.</li><li>Heroic adventurers.</li><li>Esoteric order.</li><li>Nunnery. </li></ol><p>If the topic of their research is related to the information sought by the PCs, conversing with the researchers about their findings so far adds d4 to the PC’s Progress Score.</p>"
    },
    {
      "title": "1d6 Obsidian Marmosets",
      "description": "<p><strong>HD 3, HP 12, Armour as plate and shield, Two Obsidian Fists (+0, 2d4), Save as Thief 3.</strong></p><p>Half damage from slashing and piercing weapons. Healed by heat, fire, and electricity. Double damage from cold.</p><p>Like little statues of monkeys made of interlocking shards of jagged black volcanic glass. Appear as if they were made by a master artist who merely teased out the monkey-shape nascent in the stone. Not artificial constructs—silicaceous life. </p><p>It’s not clear how they got to the Library, but they live here now. They form shy troops among the tall stacks of the shelves. They don’t need to feed, instead basking in the heat and electric glow of the Library’s machinery. Alternatingly retiring and territorial.</p>"
    },
    {
      "title": "A Bandersnatch",
      "description": "<p><strong>HD 10, HP 25, Armour as unarmoured, Two Hands (Special), Save as Thief 10.</strong></p><p>Half damage from non-iron weapons, double from iron ones. 3-in-6 chance to go unnoticed if it wants to (and hasn’t yet done anything dramatic). Long arms, 15 feet of reach.</p><p>A strange monster, escaped into the Library from fairy realms. vian in form, like a heron. Long legs, and a serpentine neck ending in its head. Instead of wings, it possesses two spindly arms that end in wide, human-like hands with splayed fingers.</p><p>The Bandersnatch lurks. It has an uncanny ability to avoid drawing attention to itself until its hands have closed around whatever it wishes to steal. This might be an object, a piece of equipment, or a person.</p><p>As a fairy creature, the Bandersnatch is as mad as a box of frogs. It’s a sort of kleptomaniac, collecting things with no seeming pattern or purpose. If prevented from taking the object it desires, it becomes enraged.</p><p>Each round, it can use each hand to do one of the following:</p><ul><li>Slap (+10 to hit, d4 damage).</li><li>Grab (+10 to hit, grabs the victim, no damage. Escaping from the grab requires 3 successful strength rolls).</li><li>Squeeze (automatically hits, 2d6 damage to a grabbed victim).</li><li>Pick a pocket (3-in-6).</li><li>Snatch a held item (5-in-6).</li></ul><p>Roll a d12 every so often for what the Bandersnatch wishes to steal right now.</p><ol><li>Food.</li><li>Shiny Things.</li><li>Beautiful People.</li><li>Eyes.</li><li>Stolen Things.</li><li>String and rope.</li><li>Tools.</li><li>Weapons.</li><li>Clothing.</li><li>Skin.</li><li>Tongues.</li><li>Maps.</li></ol>"
    },
    {
      "title": "A Flock of 1d6+1 Animate Books",
      "description": "<p><strong>HD 3, HP 12, Armour as leather, Slam (+3, d6) or Grab (+0, d4 and grab), Save as Fighter 3.</strong> </p><p>Levitates. </p><p>Immune to poison, cold, backstab and other effects that only affect living things. </p><p>Double damage from fire. </p><p>Once grabbed by an Animate Book, breaking out requires a full round spent making a Strength roll. Each round until this succeeds, 1D4 damage and lose 1 Intelligence as the book chews on its victim and digests the data stored within them.</p><p>Knowledge is power. Power corrupts. Put enough knowledge into something and it will inevitably start to overreach itself, behaving in ways it was never meant to.</p><p>That’s what’s happened to the Animate Book. A text with sufficient information density warps itself, achieves a sort of intelligence—a sort of life. It doesn’t realise it’s not alive. </p><p>Animate Books roam the Library like animals, hiding under bookshelves and making nests in the rafters. When the Librarians catch them, they’re disenchanted and returned to their proper place, inanimate on the bookshelves.</p>"
    },
    {
      "title": "1 Lost Soul",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Attack Special, Save as Fighter 4.</strong></p><p>Souls are gaseous beings, immune to all physical damage except that caused by magical items. They can pass through permeable objects, and are unaffected by fire, poison, etc.</p><p>Roll a d12 twice for what powers the lost soul has:</p><ol><li>Move objects about like a poltergeist. +3 to hit for d6 damage if it throws them at people.</li><li>Create illusions out of mist.</li><li>Cause wet, inky writing to appear on things.</li><li>Alter the memories of those present in minor ways: Save vs Magic to resist; a success also alerts the victim.</li><li>Cause something to catch fire for a few moments—Save vs Breath to avoid fire, or else it does d6 damage.</li><li>Cause ice to appear on things, potentially freezing them in place.</li><li>Extinguish lights and erase text.</li><li>Lock doors securely.</li><li>Speak in a loud voice.</li><li>Make vermin appear: masses of flies, cockroaches, or woodlice that attack for d6 damage.</li><li>Create gusts of wind.</li><li>Make objects collapse or fall apart. +3 to hit for d6 damage if used to attack.</li></ol><p>The soul of one who died within the Library, not yet drawn into the Library’s machinery and distilled into a phantom.</p><p>A Lost Soul knows what happens to the souls of the dead here. They seek to avoid being captured by the Grey Librarians and to preserve their own independence and sanity. Talking with one can reveal a great deal about the inner workings of the Library and the nature of the Engines and Calculations within. </p><p>Roll a d12 for who the Lost Soul once was:</p><ol><li>A mortal librarian.</li><li>A lost child.</li><li>A nun.</li><li>A mad nobleman.</li><li>A professor of mathematics.</li><li>A master burglar.</li><li>A famed assassin.</li><li>A plague-stricken doctor.</li><li>An emotionally tormented artist.</li><li>A census-taker.</li><li>An historian.</li><li>A genteel necromancer.</li></ol>"
    },
    {
      "title": "1d6 Black Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain the Portals.</p><p>They can cast the following each once per turn: </p><ul><li>Hold Portal</li><li>Knock</li><li>Hold Person</li><li>Turn Mortals (as Turn Undead)</li><li>Wall of Iron</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Ink Elemental and 1d4 Inkblots",
      "description": "<p><strong>Ink Elemental - HD 5, HP 30, Armour as unarmoured humans, Engulf (+5, d10), Save as Fighter 5.</strong></p><p>An oozing, creeping mass of ink. By turns: black, deep blue, or iridescent. Formless and fluid. As big as a horse. It seeps and drips. It leaves a sticky black residue behind it. </p><p>The semi-elemental nature of Ink is to spread, stain, and flow. Whilst its own form is transient and ever-shifting, the marks it leaves behind are indelible. It is the constantly-shifting force that leaves a permanent record.</p><p>Immune to physical weapons, normal damage from cold, electricity and other elemental damage. Immune to backstab due to lack of anatomy. Easily set alight by fire (takes 1 fewer damage each subsequent round as it continues to burn). Can take any shape, seep through gaps, creep up walls.</p><p>Anything it touches is permanently stained black.</p><p>Each round, can spend d6 HP to produce an Inkblot (ppxx), or absorb an Inkblot to heal d6 damage.</p><p><strong>Inkblots - HD 1, HP 1. Armour as unarmoured humans, Engulf (+1, d10), Save as Fighter 1.</strong></p><p>The residue created by Ink Elementals. Slithering black stains that follow behind the elemental, leaving a trail of black smudges. The size of a handprint.</p><p>Immune to physical weapons, normal damage from fire, cold, electricity and other elemental damage. Immune to backstab due to lack of anatomy. Can take any shape, seep through gaps, creep up walls.</p><p>Anything it touches is permanently stained black.</p><p>Can combine with up to 4 other Inkblots to produce a new Ink Elemental with d6 HP per Inkblot.</p>"
    },
    {
      "title": "1 Animate Spell",
      "description": "<p><strong>Roll a random spell. If the system you’re using doesn’t have spell levels, roll 1D8 instead where the stats below require one.</strong></p><p><strong>HD = spell level, HP = twice spell level, Armour as unarmoured human, No attacks, Save as Magic-User [level = spell level].</strong> </p><p>A spell that has broken free of its constraining spellbook and now roams the Library as an independent entity. A data-cloud of disembodied text hanging in the air, paragraphs intersecting with one another at odd angles. Letters cast strange shadows from the emergent, occult shapes they form. </p><p>The spell’s personality, nature and goals depends on which spell it actually is, as do its powers. It wants to see itself cast and to see the effects of its magic repeated—an animated Fireball spell just likes to see things burn, while an animated Charm Person spell likes people to be friends with each other).</p><p>Can cast itself once a round at no cost, with perfect control over the results. Immune to all damage from non-magical sources. Physical magical damage—from magic weapons, etc.—only deals 1 damage. </p><p>Immune to damage and negative effects from sources of the spell’s type—an Animate Fireball Spell’s immune to fire, etc.</p><p>Whenever the spell’s own spell (or a related spell) is cast nearby, that effect is controlled by the Animate Spell, not the spellcaster—if you try to cast any harm’ spell near an Animate Charm Person, that spell is controlled by the Animate Spell instead). </p><p>Anti-Magic Field, Dispel Magic, etc., neutralises the Animated Spell.</p><p>Any unfilled spell slots are immediately filled by the Animate Spell’s own spell upon encountering it. Spellbooks immediately gain a copy of it for free. </p>"
    },
    {
      "title": "1d6 Red and 1d6 Yellow Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Red Librarians maintain The Library&#39;s Infrastructure and can cast the following each once per turn: </p><ul><li>Mending</li><li>Message</li><li>Shape Stone</li><li>Shape Wood</li><li>Spider Climb</li><li>Levitate</li><li>Create Stone</li></ul><p>Yellow Librarians maintain The Books and can cast the following each once per turn: </p><ul><li>Mending</li><li>Message</li><li>Charm Person</li><li>Suggestion</li><li>Detect Thieves (as Detect Undead)</li><li>See Invisible</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Neurovore",
      "description": "<p><strong>HD 8, HP 30, Armour as chain, Psionic Blast (stun for 3D4 rounds, Save vs Magic to resist), Save as Magic-User 8.</strong> </p><p>Half-man, half-octopus, all evil. Neurovores feast on the data electrically encoded in the brains of mortals. They possess frightening psionic powers. A repository of knowledge like the Library is a veritable buffet for them, if they can subdue its guards.</p><p>Needless to say, the Librarians hate Neurovores for the way they consume and destroy knowledge. If you’re an enemy of the Librarians, the Neurovores will be unwaveringly helpful and support you to the best of their power. They need all the allies they can get in here.</p><p>Can do one of the following each round instead of attacking:</p><ul><li>Cast Charm Person, Hold Person, Suggestion, Levitate, Invisibility, or Detect Living.</li><li>Attach one of its four tentacles to a helpless or willing victim’s skull.</li><li>Attach the second, third or fourth tentacle to the skull of a victim with a tentacle already holding it.</li><li>Consume the brain of a victim with all four tentacles attached, healing all lost HP.</li></ul>"
    },
    {
      "title": "1 Hungry Book",
      "description": "<p><strong>HD 3, HP 12, Armour as leather, Slam (+3, d4 and Information Drain), Save as Fighter 3.</strong> </p><p>Immune to poison, cold, backstab and other effects that only affect living things. Double damage from fire. </p><p>Books exist to hold information. Of course with the density of information present, sometimes this goes wrong. The books want more. They scour the data from every other book on their shelf, absorbing it into themselves, and head off in search of more.</p><p>A hungry book is only clumsily animated by the dim intelligence stirring within it. It uses its pages to crawl along the ground, sniffing out data to absorb.</p><p>A hit from the book drains data from the victim. Pick one:</p><ul><li>The party loses d4 Progress.</li><li>The victim loses 1 point of Intelligence permanently. </li><li>A scroll carried by the victim is absorbed and becomes useless.</li><li>A spell in the victim’s spellbook is absorbed and becomes useless.</li><li>Another book carried by the victim is absorbed and becomes useless.</li></ul>"
    },
    {
      "title": "2d6 Lantern-Bearers",
      "description": "<p><strong>HD 3, Hit Points 10, Armour as leather, Smack with Lantern (+3, d4) or Radiant Burst (all illuminated Save vs Magic or take 1 damage), Save as Thief 3.</strong></p><p>All invisible beings within the area illuminated by the lantern-bearer are revealed, all illusions negated while the light touches them.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p><p>A little hunched figure, no larger than a child, in a faded red robe that conceals its form entirely. It carries a lamp hooked on the end of a long metal pole that sways and bobs as the lantern-bearer shuffles through the Library on its endless patrol.</p><p>This is the fate of those thieves who try to steal from the Library, their bodies withered and their minds warped into loyal servants of the Librarians, tasked with rooting out others of their kind.</p>"
    },
    {
      "title": "1 Archivist-Lich",
      "description": "<p><strong>HD 10, HP 40, Armour as plate, Lich’s Finger (+10, d10 and paralysis 1 turn), Save as Magic-User 10. Normal undead immunities and vulnerabilities. Cannot be turned.</strong></p><p>A once-mortal scholar whose need to see their work finished has seen them seamlessly transition into undeath. Hundreds of years old, consumed by their research. Little more than a dusty skeleton in a robe by now.</p><p>An impressive intelligence. Highly educated, well spoken, polite and genteel. Obsessive. Has been exploring the Library for decades.</p><p>Roll a d100 twice on the Random Books Table to determine the current nature of the Lich’s research. Conversation with the Lich about the Library and its layout grants +3 Progress, or +5 if the topic of the PCs’ research matches theirs.</p><p>The lich is a spellcaster. Each day it can cast each of the following once:</p><ul><li>Hold Person.</li><li>Disintegrate.</li><li>Dispel Magic.</li><li>Detect Magic.</li></ul><p>Furthermore, roll a d20 three times on the list below for what other spells the Lich has available:</p><ol><li>Wall of Ice.</li><li>Wall of Iron.</li><li>Flesh to Stone and Stone to Flesh.</li><li>Charm Person (twice).</li><li>Suggestion (twice).</li><li>Heat Metal.</li><li>Teleport Self.</li><li>Antimagic Sphere.</li><li>Dominate Monster.</li><li>Animate Dead (twice).</li><li>Sleep (twice).</li><li>Cloudkill &amp; Mist Form.</li><li>Magic Jar.</li><li>Animate Object (twice).</li><li>Lightning Bolt (10d6).</li><li>Magic Missile (twice, 5 missiles doing d4+1 each).</li><li>Mirror Images.</li><li>Create Illusions (three times).</li><li>Power Word: Kill, Power Word: Blind, and Power Word: Madness. </li><li>Polymorph Self.</li></ol><p>Although the Lich has a body that can be destroyed, it cannot be killed permanently. Somewhere in the Library is its phylactery—an item to which the Lich’s soul is bound. If destroyed, the Lich’s body will slowly re-form at its phylactery over the course of a day—and it will come back angry. Only after destroying the phylactery can the Lich be killed permanently.</p><p>To determine what the Lich’s phylactery is, roll on the Extraordinary Book Table. The next time that exact book is encountered by the PCs, it’s the Lich’s phylactery.</p>"
    },
    {
      "title": "An Escaped Fiction",
      "description": "<p><strong>HD 5, HP 15, Armour as appropriate for the character, Weapon as appropriate for the character (+5, 1D8) or else Unarmed (+0, d4), Save as Thief 5.</strong> </p><p>Once, these beings were mere characters in a story book, but now they’ve clawed their way out into the fractally-dense information cloud of the Library. They’re not truly real, but it&#39;s hard to tell—they’re very convincing.</p><p>They subconsciously crave reality. To warp the real world around their narrative so that they are part of the everyday order of things. Reality obliges. Where they pass, things alter to fit the fiction they have emerged from. You’re playing by their rules, now.</p><p>Roll a d12 to determine who you meet:</p><ol><li>Don Quixote, who tilted at windmills.</li><li>Frankenstein’s Monster, who was built from corpses.</li><li>Grendel, a monstrous inhabitant of the wilderness, who hates noise and celebration, one arm torn clean off.</li><li>Doctor Faustus, an occultist who regrets selling his soul.</li><li>Count Dracula, the monstrous vampire.</li><li>Lady Macbeth, ambitious and murderous, and of much-degraded sanity.</li><li>The Ghost of Christmas Future, who delivers dire warnings to the mean-spirited.</li><li>Bluebeard, a dashingly handsome murderer of his many wives.</li><li>Sir Lancelot, brilliant knight and enthusiastic adulterer.</li><li>Robin Hood, a charitable bandit and excellent shot.</li><li>Puck, the mischievous fairy sprite.</li><li>Jack the Giant-Slayer, young and reckless, but cunning.</li></ol><p>Vulnerabilities, quirks, powers or immunities appropriate for their character. </p><p>Attacks or other actions against them that do not fit the setting or narrative style of the work they are from fail automatically. For example, guns simply don’t exist to Sir Lancelot, so he cannot be harmed by them.</p><p>Reality shifts to accommodate the character, and behaves like the setting they’re from, not this reality. Actions intended to fit the character’s setting and narrative (such as deceiving Don Quixote into behaving chivalrously) automatically succeed. </p><p>In practice, this means that you should alter the tone and feel of your game while an escaped fiction is around. Some examples include:</p><ul><li>Blood doesn’t get spilled around characters written for children. Tone down any descriptions of gore and violence.</li><li>Conversely, for characters from more bloody and brutal tales, ratchet the violence all the way up.</li><li>Horror characters call for appropriately Gothic lighting and effects.</li><li>Technology reverts to that of the time period of the character’s setting. Items from later in history (such as guns and clockwork) simply cease to function.</li><li>In extreme examples, the PCs may be able to hear a non-diegetic soundtrack (such as trumpet fanfares for Lancelot, or low, tense strings for Lady Macbeth).</li></ul>"
    },
    {
      "title": "A Throng of 1d6 Phantoms",
      "description": "<p><strong>HD 1, HP 1, Armour as unarmoured humans, Emotional Lash (Save vs Paralysis to avoid), Save as Fighter 1.</strong></p><p>Phantoms are the spiritual remainders of a dead mortal, stripped down to their most basic form. Personality and thought eroded, Phantoms are little more than spiritual automata laden with the collected data of some mortal&#39;s lifetime. Suffice to say, such beings are ripe for exploitation by a skilled necromancer. Thus, they have become invaluable to the infrastructure of the Library, which stores them in glass tubes and uses them to power all manner of arcane machines.</p><p>Phantoms are gaseous beings, immune to all physical damage except that caused by magical items. They can pass through permeable objects, and are unaffected by fire, poison, etc.</p><p>An emotional lash is not a physical attack (indeed a phantom is incapable of affecting the physical world directly), but rather a projection of raw emotion into the mind of its victim. The effects of a phantom&#39;s emotional lash depend on its current emotional state:</p><ul><li>Contentment or Torpor: The victim has disadvantage on all rolls to act in anger or other strong emotions for one round.</li><li>Pain or Irritation: d4 damage.</li><li>Rage or Anguish: The victim must spend their next action attacking the subject of the phantom&#39;s emotions, or take d8 damage.</li><li>Fear or Despair: The victim must spend their next action hiding or cowering, or take d8 damage.</li><li>Hunger or Envy: The victim must spend their next action presenting the phantom with what it desires, or take d8 damage.</li></ul><p>A phantom&#39;s emotions are simple and direct, like those of an infant not yet able to talk or an unsophisticated animal. It understands speech only vaguely, and is able to detect emotion and tone but not precise meanings. Influencing its emotions—to calm it, or agitate it and direct it against enemies—is simple to achieve, perhaps requiring a Charisma roll if the PCs have a sensible plan. It always fails Saves to resist magical effects that manipulate its emotions.</p>"
    },
    {
      "title": "1d6 White Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Tend to the Calculations.</p><p>They can cast the following each once per turn: </p><ul><li>Invisibility</li><li>Dispel Magic</li><li>Levitate</li><li>Inflict Blindness</li><li>Inflict Deafness</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "2d6 Crawling Things",
      "description": "<p><strong>HD 1, HP 5, Armour as leather, Claw and Clutch (+1, d6), Save as Fighter 1.</strong></p><p>Improbable chimeric organisms that should not be biologically viable, and yet somehow live—twitching, shuddering, crawling. Driven by glitching muscle memory and scrambled genetic instincts. A broken democracy of mismatched anatomies. Tragically incomplete.</p><p>They want to be a whole organism. They do this by incorporating parts from those they encounter, torn off and jammed into the Crawling Thing’s amalgamated flesh.</p><p>Slow. Basically blind and deaf—but not completely, allowing a dim awareness.</p><p>If its attack hits, it latches onto the victim and begins incorporating their flesh into itself. Each round thereafter it deals damage automatically and heals by that much. To remove it, pass a Strength check or kill it.</p>"
    },
    {
      "title": "2d6 Educated Rodents",
      "description": "<p><strong>HD 1, HP 3, Armour as leather, Clawing Bite (+1, d4), Save as Thief 1.</strong></p><p>Mice that have achieved human-like self awareness simply by absorbing the residual knowledge of the Library. They know things they’ve read, but have little to no direct experience of the outside world. They are somewhat credulous, but formidably cunning. They enjoy cheese, wine, interesting conversation, and elegant music. They dislike cats, ghosts, and other scary things.</p><p>If angered, they attack with sophisticated tactics, gleaned from books on chess and famous battles. They outflank, pin enemies in place, cut off retreats and hold dominant positions.</p><p>In any brood of educated rodents, each will have studied different fields of knowledge. Go down the list in order for what each rodent can do, starting with the first (if five rodents are encountered, the first five roles are present):</p><ol><li>The first mouse has studied the arcane arts. It can cast Detect Magic and Dispel Magic each once per day.</li><li>The second has studied engineering. 50% chance to open or seal any lock, fix or disable any mechanical item, etc. Takes only one round to do this.</li><li>The third has studied military history. It’s bite is (+3, d8).</li><li>The fourth has studied medicine. It can spend its full round in combat to heal d3 HP an ally has lost.</li><li>The fifth has studied theology and become devout. Its attacks count as holy and magical and do double damage to undead or unholy things.</li><li>The sixth has studied oratory. It can cast Charm Person once per day.</li><li>The seventh has studied physics. It can cast Levitate once per day.</li><li>The eighth has studied zoology. It can cast Charm Animal and Speak With Animals each once per day.</li><li>The ninth has studied thanatology and can cast Detect Undead and Speak With Dead each once per day.</li><li>The tenth has studied fine cuisine. It is well nourished and healthy—it has 6 HP.</li><li>The eleventh has studied politics. When it attacks a surprised or unaware enemy, it gets +4 to hit and does double damage.</li><li>The twelfth has studied psychology. 5-in-6 chance to spot any lie told to it (all other mice believe any lie they hear).</li></ol><p>Further mice have studied some interesting but ultimately useless field in the humanities.</p>"
    },
    {
      "title": "1 Eye Sentinel",
      "description": "<p><strong>HD 8, HP 8, Armour as chain (forcefield), Gentle Bump (+0, 1 damage) or Special, Saves as Magic-User 8.</strong></p><p>A single, huge, floating eyeball, levitated by psychic might alone. Sometimes, a Jarred Brain develops mighty psionic powers and escapes its jar. Sometimes, such beings are recaptured by the Librarians. This is what the Librarians do to them.</p><p>The Librarian use Eye Sentinels to monitor less frequently visited areas to ensure everything is running according to the Librarians’ schedule. </p><p>Levitates. Perceives the world through psychic resonances—hiding behind things won’t help, but emptying your mind of thoughts makes you invisible to them.</p><p>An Eye Sentinel has mighty psionic powers. Each round, it can do one of the following:</p><ul><li>Project pain (everybody must Save vs Magic or take d4 damage).</li><li>Project fatigue (target must Save vs Magic or fall asleep).</li><li>Read a mind,and edit one memory (Save vs Magic to resist).</li><li>Cast Suggestion (Save vs Magic to resist).</li><li>Summon Librarians. Either 1D6 from a particular Order, or one of each Order. The Librarians step out from behind a bookshelf next round.</li></ul>"
    },
    {
      "title": "1d6 Grey Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Shepherd the Restless Dead.</p><p>They can cast the following each once per turn: </p><ul><li>Detect Undead</li><li>See Invisible</li><li>Trap the Soul</li><li>Command Undead</li><li>Reduce to Phantom</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Black Ooze",
      "description": "<p><strong>HD 1D8, HP = HD, Armour as unarmoured human, Mental Digestion (Special) saves as Fighter [level = Current HD].</strong></p><p>Like the green slime found infesting less genteel dungeons. Black Ooze is a simple life form that grows in unattended nooks and crannies. It feeds on mental energy. If it touches you, it can digest your brainwaves, causing it to grow rapidly as it absorbs and incorporates your mind. It oozes like an amoeba. It creeps under floorboards and behind wallpaper. It’s hungry.</p><p>As an Ooze, takes a maximum of 1 damage from any slashing or piercing attack. Immune to backstab due to lack of anatomy. Mindless. Can climb up walls, squeeze through gaps, etc.</p><p>Mental Digestion has a bonus to hit equal to the Ooze’s current HD and HP(an ooze with 5 HP left is HD 5 and has +5 to hit). Every time you touch it, it gets to make a free Mental Digestion attack against you.</p><p>Mental Digestion deals damage equal to d6 plus the target’s current Intelligence modifier to the target’s Intelligence score (a target with 8 Intelligence takes d6-1 Intelligence damage, because they have a –1 Intelligence modifier). The Ooze then gains as many HD as the damage dealt. </p>"
    },
    {
      "title": "1 Conceptual Well",
      "description": "<p><strong>HD 1, HP 1, Armour as unarmoured human, Erase Concepts (Special, Save vs Magic to resist) and Unreal Knife (+1, d6), Saves as Magic-User 1.</strong></p><p>An intellectual absence, cosmic censorship. A space that cannot be perceived or conceptualized. Like a psychological black hole. It cannot be perceived directly. Describe it through negation: “here isn’t something horrible in the room,” or “Nothing has rolled a 6 for its Initiative,” or “The thing that is not in front of you attacks,” or “Nothing is definitely responsible for your comrade’s death.” The players might catch on eventually, it’s just a matter of how badly it will have mutilated their PCs by then.</p><p>The PCs can target it using the same language: “I’m going to shoot nothing,” or “I’m not fleeing from anything.” They can get details about it by asking negative questions, such as “here isn’t there anything?” or “What does nothing here look like?”</p><p>If it matters, the conceptual well doesn’t look like a helpless child of around four years old. It isn’t young and innocent, and it isn’t curious about its surroundings or playful. It isn’t basically helpless as soon as the PCs actually attack it, and it doesn’t die pitifully. It also might not be violent towards the PCs. It doesn’t fundamentally fail to comprehend them, and doesn’t try to take them apart to see how they work.</p><p>It will get confusing. Good. This is an accurate simulation of what it’s like encountering something you can’t perceive and which directly assaults your ability to comprehend the external world.</p><p>Each round, for each PC that fails their save, the Conceptual Well drains their ability to comprehend some idea or concept. Roll a 1D20 for what they forget:</p><ol><li>That people can die.</li><li>Mathematics.</li><li>Money and its value.</li><li>Romance.</li><li>Violence.</li><li>Everybody related to them by blood.</li><li>Fire.</li><li>That other people have feelings, too.</li><li>Gravity.</li><li>All their superiors, and why they should be obeyed. </li><li>That animals can’t talk or reason like people can.</li><li>Everybody they hate.</li><li>That people can lie.</li><li>Pain.</li><li>How people come to exist.</li><li>Families.</li><li>Social Inequality.</li><li>Why we should obey the law, and what happens when we don’t.</li><li>Where food comes from.</li><li>That dreams aren’t real.</li></ol><p>If a PC acts in a way that suggests they are aware of an erased concept, they take d20 damage—unless they immediately retcon the action when prompted.</p>"
    }
  ],
  "intruderEncounters": [
    {
      "title": "1 Black Librarian",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain the Portals.</p><p>They can cast the following each once per turn: </p><ul><li>Hold Portal</li><li>Knock</li><li>Hold Person</li><li>Turn Mortals (as Turn Undead)</li><li>Wall of Iron</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1d6+6 Tooth-wardens",
      "description": "<p><strong>HD 1, HP 1, Armour as chain, Chomp (Special), Save as Magic-User 1.</strong> </p><p>Little floating teeth, each perfectly preserved. They hang in the air in a roughly mouth-shaped pattern. They talk in unison, the ‘mouth’ they create changing shape to match their words.</p><p>Their intelligence is somewhere between a group of children and a flock of birds. They chatter endlessly, think everything is exciting.</p><p>If a Skull-Warden is present, then the Tooth-Wardens fawn over it like children over a favourite grandparent. Everything the Skull-Warden does is wise and interesting and brilliant. </p><p>Normal undead immunities &amp; vulnerabilities. Levitate.</p><p>All the Tooth-Wardens make a single attack together, representing their collective jaws biting. +X to hit, and exactly X damage, where X is the amount of Tooth-Wardens in the jaws.</p>"
    },
    {
      "title": "1 Giant Bookworm",
      "description": "<p><strong>HD 2, HP 11, Armour as leather, 6 tendrils (+0, paralysis for d6 rounds) or Bite (d6 damage vs helpless victim), Save as Fighter 2.</strong></p><p>This creature appears as a huge, fleshy, pallid insect larvae. A fat, segmented body, like that of a caterpillar or maggot, ends with a head studded with tiny black eyes, with six waving tendrils around its mouth. The creature is about the size of a human torso in length and thickness, the tendrils extending another foot or so.</p><p>The bookworms can chew a tunnel through wood or paper, but this is not their preferred food—they favour hunting as ambush predators. Many bookshelves and floors hide—beneath a seemingly normal surface—a network of bookworm tunnels through which the creature crawls in search of prey, bursting from its burrows to pick off vulnerable visitors to the Library.</p>"
    },
    {
      "title": "1d4 Red Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain The Library&#39;s Infrastructure.</p><p>They can cast the following each once per turn: </p><ul><li>Mending, Message</li><li>Shape Stone</li><li>Shape Wood</li><li>Spider Climb</li><li>Levitate</li><li>Create Stone</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Rust Moth",
      "description": "<p><strong>HD 1, HP 4, Armour as plate, 2 Antennae (+0, ruins a piece of metal equipment), Save as Fighter 1.</strong></p><p>Related to a wide variety of similar insectile creatures (most notably the cockroach-like Rust Monsters), these creatures feed by corroding metal into an oxidised powder that they can digest. </p><p>Rust Moths are the size of a human hand, with orange-brown bodies covered in flaky metallic scales and wings like corroded metal foil. Most noticeable are the antennae that sprout from their heads, which are their main form of attack.</p>"
    },
    {
      "title": "1 Dust Elemental",
      "description": "<p><strong>HD 5, HP 20, Armour as unarmoured, Crumbling Touch (+5, d8 damage), Save as Fighter 5.</strong></p><p>Immune to normal weapons and physical attacks. </p><p>Takes 2d6 damage per round from fire, cleaning with water, strong winds, etc. </p><p>Immune to poison, pain, fear, etc. </p><p>Can seep through any crack or gap. </p><p>Little elemental incarnations, conglomerates of dust, grit, dirt, and fluff. Like somebody scattered detritus on the ground in the rough shape of a human. It lurks under bookshelves, drifts on imperceptible drafts, and creeps forward.</p><p>The quasi-elemental nature of dust is one of things broken down, crumbling, desiccated. It is not particularly compatible with life, and the attentions of such an elemental are likely extremely unpleasant.</p>"
    },
    {
      "title": "1 Lantern-Bearer",
      "description": "<p><strong>HD 3, Hit Points 10, Armour as leather, Smack with Lantern (+3, d4) or Radiant Burst (all illuminated Save vs Magic or take 1 damage), Save as Thief 3.</strong></p><p>All invisible beings within the area illuminated by the lantern-bearer are revealed, all illusions negated while the light touches them.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p><p>A little hunched figure, no larger than a child, in a faded red robe that conceals its form entirely. It carries a lamp hooked on the end of a long metal pole that sways and bobs as the lantern-bearer shuffles through the Library on its endless patrol.</p><p>This is the fate of those thieves who try to steal from the Library, their bodies withered and their minds warped into loyal servants of the Librarians, tasked with rooting out others of their kind.</p>"
    },
    {
      "title": "1d4 Furious Books",
      "description": "<p><strong>HD 3, HP 12, Armour as leather, Slam (+0, d6 and Intelligence Drain), Save as Fighter 3. Can levitate. Immune to poison, cold, backstab and other effects that only affect living things. Double damage from fire.</strong> </p><p>Each successful hit permanently reduces the victim’s Intelligence by 1. Every time this happens, the book gains another chapter and a half-inch of thickness.</p><p>An animated book that, as a result of the horrible and inflammatory knowledge within, is really just unreasonably pissed off at the world. </p><p>Flaps about using its covers like wings, and then hurls itself at anything that attracts its fury.</p>"
    },
    {
      "title": "2d6 Paper Bees",
      "description": "<p><strong>HD 1, HP 3, Armour as leather, Sting (+1, d8 damage to the Bee and its victim) Save as Fighter 1.</strong></p><p>Bees the size of a human hand that inhabit the infrequently visited corners of the Library. They feed on ink and grime rather than nectar, and distill it into Black Honey.When Paper Bees are encountered, they’ve probably got a hive not too far away. If the players decide to track where the Bees go, then after Going Deeper d4 more times, they will find a paper beehive.</p>"
    },
    {
      "title": "1 Guardian Shade",
      "description": "<p><strong>HD 2, HP 7, Armour as unarmoured humans, Chilling Aura (d4 damage and strength drain, Save vs Paralysis to avoid), Save as Fighter 1.</strong></p><p>Shades are gaseous beings, immune to all physical damage except that caused by magical items. They can pass through permeable objects, and are unaffected by fire, poison, etc.</p><p>As well as damage, those affected by a shade’s aura lose d4 points of Strength permanently. Those reduced to 0 Strength are resurrected as another shade totally enslaved to their progenitor.</p><p>A human soul, compressed and refined into a weapon. Appears as a patch of darkness hanging in the air, vaguely reminiscent of a human silhouette, like a miasma or shadow. </p><p>It does not remember its former life. It exists to serve, to hunt and destroy those who threaten the Library. It’s single-minded and has little ability to conceptualize ideas outside of its role as a guard.</p><p>Conscious beings can tell that it is unnatural. It’s presence makes their skin crawl, and their stomach churn. </p>"
    },
    {
      "title": "1d6 Yellow Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain The Books.</p><p>They can cast the following each once per turn: </p><ul><li>Mending</li><li>Message</li><li>Charm Person</li><li>Suggestion</li><li>Detect Thieves (as Detect Undead)</li><li>See Invisible</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1d4 Ogre Spiders",
      "description": "<p><strong>HD 3, HP 12, Armour as leather, Bite (+3, d6 and Save vs Poison) or Net (+3, Save vs Paralysis or be entangled and helpless), Save as Fighter 3. Can walk up walls and over ceilings. Poison does d8 damage to Dexterity.</strong> </p><p>Huge spiders the size of dogs that dwell in the ceilings and vents of the Library. They hunt in the dark, creeping above their prey before dropping their webs like a net.</p><p>An Ogre Spider’s abdomen is long and thin, resembling that of a praying mantis more than the normal, bulbous appearance of typical spiders. Meanwhile, their faces feature huge black eyes and thick maxillae that resemble a human skull.</p>"
    },
    {
      "title": "1 Phantom",
      "description": "<p><strong>HD 1, HP 1, Armour as unarmoured humans, Emotional Lash (Save vs Paralysis to avoid), Save as Fighter 1.</strong></p><p>Phantoms are the spiritual remainders of a dead mortal, stripped down to their most basic form. Personality and thought eroded, Phantoms are little more than spiritual automata laden with the collected data of some mortal&#39;s lifetime. Suffice to say, such beings are ripe for exploitation by a skilled necromancer. Thus, they have become invaluable to the infrastructure of the Library, which stores them in glass tubes and uses them to power all manner of arcane machines.</p><p>Phantoms are gaseous beings, immune to all physical damage except that caused by magical items. They can pass through permeable objects, and are unaffected by fire, poison, etc.</p><p>An emotional lash is not a physical attack (indeed a phantom is incapable of affecting the physical world directly), but rather a projection of raw emotion into the mind of its victim. The effects of a phantom&#39;s emotional lash depend on its current emotional state:</p><ul><li>Contentment or Torpor: The victim has disadvantage on all rolls to act in anger or other strong emotions for one round.</li><li>Pain or Irritation: d4 damage.</li><li>Rage or Anguish: The victim must spend their next action attacking the subject of the phantom&#39;s emotions, or take d8 damage.</li><li>Fear or Despair: The victim must spend their next action hiding or cowering, or take d8 damage.</li><li>Hunger or Envy: The victim must spend their next action presenting the phantom with what it desires, or take d8 damage.</li></ul><p>A phantom&#39;s emotions are simple and direct, like those of an infant not yet able to talk or an unsophisticated animal. It understands speech only vaguely, and is able to detect emotion and tone but not precise meanings. Influencing its emotions—to calm it, or agitate it and direct it against enemies—is simple to achieve, perhaps requiring a Charisma roll if the PCs have a sensible plan. It always fails Saves to resist magical effects that manipulate its emotions.</p>"
    },
    {
      "title": "1d6 Floating Brains",
      "description": "<p><strong>HD 8, HP 8, Armour as chain (forcefield), Gentle Bump (+0, 1 damage) or Special, Save as Magic-User 8.</strong></p><p>Levitates. </p><p>Blind. </p><p>Perceives the world through psychic resonances—hiding behind things won’t help, but emptying your mind of thoughts effectively makes you invisible to them.</p><p>Roll d10 twice on the list below for what else the choir can do. All will have the same powers.</p><ol><li>Project pain (all nearby Save vs Magic or take d4 damage).</li><li>Communicate telepathically.</li><li>Cause hallucinations (Save vs Magic to resist).</li><li>Teleport objects short distances.</li><li>Read memories. Erase memories read, if they want (Save vs Magic to resist erasure).</li><li>Move things telekinetically (+8 to hit, d4-d12 damage, depending on what’s used to attack).</li><li>Cause inanimate objects to crumble to dust.</li><li>Predict the immediate future. (1-in-6 chance to resist any effect through prescience).</li><li>Teleport self short distances.</li><li>Cause sleep (Save vs Magic).</li></ol><p>Remember those brains in jars? Sometimes, the isolation of a Jarred Brain has an odd effect on the mind of the interred brain. Introspection and contemplation cut off from all sensory stimulus or ability to act result in profound shifts in outlook and strange ways of thinking. </p><p>At its most dramatic extreme, such a paradigm shift in the imprisoned brain’s thinking can unlock the mind’s hidden psychoactive potential. Flexing newly-discovered psionic muscles, some of these brains break free of their glassy prison and escape. </p><p>Such brains only interact with the world through their psychic powers, and thus form a beacon to others of their kind. Soon they gather together into a sort of psionic choir, a loose flock of Floating Brains bobbing along on invisible psychokinetic currents, trailing their useless spinal columns behind them.</p><p>Needless to say, such beings are not too fond of the Librarians that imprisoned them. They’re not too fond of any Neurovores in the library either, since Floating Brains form those creatures’ main diet.</p>"
    },
    {
      "title": "1 Bandersnatch",
      "description": "<p><strong>HD 10, HP 25, Armour as unarmoured, Two Hands (Special), Save as Thief 10.</strong></p><p>Half damage from non-iron weapons, double from iron ones. 3-in-6 chance to go unnoticed if it wants to (and hasn’t yet done anything dramatic). Long arms, 15 feet of reach.</p><p>A strange monster, escaped into the Library from fairy realms. vian in form, like a heron. Long legs, and a serpentine neck ending in its head. Instead of wings, it possesses two spindly arms that end in wide, human-like hands with splayed fingers.</p><p>The Bandersnatch lurks. It has an uncanny ability to avoid drawing attention to itself until its hands have closed around whatever it wishes to steal. This might be an object, a piece of equipment, or a person.</p><p>As a fairy creature, the Bandersnatch is as mad as a box of frogs. It’s a sort of kleptomaniac, collecting things with no seeming pattern or purpose. If prevented from taking the object it desires, it becomes enraged.</p><p>Each round, it can use each hand to do one of the following:</p><ul><li>Slap (+10 to hit, d4 damage).</li><li>Grab (+10 to hit, grabs the victim, no damage. Escaping from the grab requires 3 successful strength rolls).</li><li>Squeeze (automatically hits, 2d6 damage to a grabbed victim).</li><li>Pick a pocket (3-in-6).</li><li>Snatch a held item (5-in-6).</li></ul><p>Roll a d12 every so often for what the Bandersnatch wishes to steal right now.</p><ol><li>Food.</li><li>Shiny Things.</li><li>Beautiful People.</li><li>Eyes.</li><li>Stolen Things.</li><li>String and rope.</li><li>Tools.</li><li>Weapons.</li><li>Clothing.</li><li>Skin.</li><li>Tongues.</li><li>Maps.</li></ol>"
    },
    {
      "title": "A Flock of 1d6+1 Animate Books",
      "description": "<p><strong>HD 3, HP 12, Armour as leather, Slam (+3, d6) or Grab (+0, d4 and grab), Save as Fighter 3.</strong> </p><p>Levitates. </p><p>Immune to poison, cold, backstab and other effects that only affect living things. </p><p>Double damage from fire. </p><p>Once grabbed by an Animate Book, breaking out requires a full round spent making a Strength roll. Each round until this succeeds, 1D4 damage and lose 1 Intelligence as the book chews on its victim and digests the data stored within them.</p><p>Knowledge is power. Power corrupts. Put enough knowledge into something and it will inevitably start to overreach itself, behaving in ways it was never meant to.</p><p>That’s what’s happened to the Animate Book. A text with sufficient information density warps itself, achieves a sort of intelligence—a sort of life. It doesn’t realise it’s not alive. </p><p>Animate Books roam the Library like animals, hiding under bookshelves and making nests in the rafters. When the Librarians catch them, they’re disenchanted and returned to their proper place, inanimate on the bookshelves.</p>"
    },
    {
      "title": "1 Lost Soul",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Attack Special, Save as Fighter 4.</strong></p><p>Souls are gaseous beings, immune to all physical damage except that caused by magical items. They can pass through permeable objects, and are unaffected by fire, poison, etc.</p><p>Roll a d12 twice for what powers the lost soul has:</p><ol><li>Move objects about like a poltergeist. +3 to hit for d6 damage if it throws them at people.</li><li>Create illusions out of mist.</li><li>Cause wet, inky writing to appear on things.</li><li>Alter the memories of those present in minor ways: Save vs Magic to resist; a success also alerts the victim.</li><li>Cause something to catch fire for a few moments—Save vs Breath to avoid fire, or else it does d6 damage.</li><li>Cause ice to appear on things, potentially freezing them in place.</li><li>Extinguish lights and erase text.</li><li>Lock doors securely.</li><li>Speak in a loud voice.</li><li>Make vermin appear: masses of flies, cockroaches, or woodlice that attack for d6 damage.</li><li>Create gusts of wind.</li><li>Make objects collapse or fall apart. +3 to hit for d6 damage if used to attack.</li></ol><p>The soul of one who died within the Library, not yet drawn into the Library’s machinery and distilled into a phantom.</p><p>A Lost Soul knows what happens to the souls of the dead here. They seek to avoid being captured by the Grey Librarians and to preserve their own independence and sanity. Talking with one can reveal a great deal about the inner workings of the Library and the nature of the Engines and Calculations within. </p><p>Roll a d12 for who the Lost Soul once was:</p><ol><li>A mortal librarian.</li><li>A lost child.</li><li>A nun.</li><li>A mad nobleman.</li><li>A professor of mathematics.</li><li>A master burglar.</li><li>A famed assassin.</li><li>A plague-stricken doctor.</li><li>An emotionally tormented artist.</li><li>A census-taker.</li><li>An historian.</li><li>A genteel necromancer.</li></ol>"
    },
    {
      "title": "1d6 Black Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Maintain the Portals.</p><p>They can cast the following each once per turn: </p><ul><li>Hold Portal</li><li>Knock</li><li>Hold Person</li><li>Turn Mortals (as Turn Undead)</li><li>Wall of Iron</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Skull-warden and 2d6 Tooth-wardens",
      "description": "<p><strong>Skull-Warden - HD 11, HP 22, Armour as chain, d6 Necromantic Laser eams (+11, d6), Save as Magic-User 11.</strong> </p><p>A large skull with a single eye socket, perhaps taken from a cyclops, perhaps from some beast—an elephant or deformed whale. Bleached white, perfectly preserved. Hanging in the air as if from invisible threads.</p><p>Intelligent. Pompous, impressed only by its own cleverness. Uses big words, belittles the intellect of those in discussion with it, loudly proclaims its own genius in conversation or battle. Despite its arrogance, it’s a mighty foe that projects beams of necrotic power from the cavities and crevices in its skull.</p><p>Normal undead immunities &amp; vulnerabilities. Levitates.</p><p>The Skull-Warden’s single eye socket emits a gaze that suppresses magic. All magic ceases to function where it looks for as long as its gaze lingers.</p><p>Each round, it can use each of the following rays once, instead of one of its laser beams (roll to hit as normal).</p><ul><li>Levitation (target rises 10 feet per round while in the ray).</li><li>Expansion (target is twice as big while in the ray).</li><li>Contraction (target is half as big while in the ray).</li><li>Stasis (target is held in place and cannot move from its current position while in the ray).</li><li>Attraction (subject is pulled 10 feet closer to the Skull-Warden each round that they remain in the ray, and cannot escape or move back).</li><li>Petrification (target turns to stone for d6 rounds, Save vs Magic to resist).</li></ul><p><strong>Tooth-Wardens - HD 1, HP 1, Armour as chain, Chomp (Special), Save as Magic-User 1.</strong> </p><p>Little floating teeth, each perfectly preserved. They hang in the air in a roughly mouth-shaped pattern. They talk in unison, the ‘mouth’ they create changing shape to match their words.</p><p>Their intelligence is somewhere between a group of children and a flock of birds. They chatter endlessly, think everything is exciting.</p><p>If a Skull-Warden is present, then the Tooth-Wardens fawn over it like children over a favourite grandparent. Everything the Skull-Warden does is wise and interesting and brilliant. </p><p>Normal undead immunities &amp; vulnerabilities. Levitate.</p><p>All the Tooth-Wardens make a single attack together, representing their collective jaws biting. +X to hit, and exactly X damage, where X is the amount of Tooth-Wardens in the jaws.</p>"
    },
    {
      "title": "1 Animate Spell",
      "description": "<p><strong>Roll a random spell. If the system you’re using doesn’t have spell levels, roll 1D8 instead where the stats below require one.</strong></p><p><strong>HD = spell level, HP = twice spell level, Armour as unarmoured human, No attacks, Save as Magic-User [level = spell level].</strong> </p><p>A spell that has broken free of its constraining spellbook and now roams the Library as an independent entity. A data-cloud of disembodied text hanging in the air, paragraphs intersecting with one another at odd angles. Letters cast strange shadows from the emergent, occult shapes they form. </p><p>The spell’s personality, nature and goals depends on which spell it actually is, as do its powers. It wants to see itself cast and to see the effects of its magic repeated—an animated Fireball spell just likes to see things burn, while an animated Charm Person spell likes people to be friends with each other).</p><p>Can cast itself once a round at no cost, with perfect control over the results. Immune to all damage from non-magical sources. Physical magical damage—from magic weapons, etc.—only deals 1 damage. </p><p>Immune to damage and negative effects from sources of the spell’s type—an Animate Fireball Spell’s immune to fire, etc.</p><p>Whenever the spell’s own spell (or a related spell) is cast nearby, that effect is controlled by the Animate Spell, not the spellcaster—if you try to cast any harm’ spell near an Animate Charm Person, that spell is controlled by the Animate Spell instead). </p><p>Anti-Magic Field, Dispel Magic, etc., neutralises the Animated Spell.</p><p>Any unfilled spell slots are immediately filled by the Animate Spell’s own spell upon encountering it. Spellbooks immediately gain a copy of it for free. </p>"
    },
    {
      "title": "1d6 Red and 1d6 Yellow Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Red Librarians maintain The Library&#39;s Infrastructure and can cast the following each once per turn: </p><ul><li>Mending</li><li>Message</li><li>Shape Stone</li><li>Shape Wood</li><li>Spider Climb</li><li>Levitate</li><li>Create Stone</li></ul><p>Yellow Librarians maintain The Books and can cast the following each once per turn: </p><ul><li>Mending</li><li>Message</li><li>Charm Person</li><li>Suggestion</li><li>Detect Thieves (as Detect Undead)</li><li>See Invisible</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Neurovore",
      "description": "<p><strong>HD 8, HP 30, Armour as chain, Psionic Blast (stun for 3D4 rounds, Save vs Magic to resist), Save as Magic-User 8.</strong> </p><p>Half-man, half-octopus, all evil. Neurovores feast on the data electrically encoded in the brains of mortals. They possess frightening psionic powers. A repository of knowledge like the Library is a veritable buffet for them, if they can subdue its guards.</p><p>Needless to say, the Librarians hate Neurovores for the way they consume and destroy knowledge. If you’re an enemy of the Librarians, the Neurovores will be unwaveringly helpful and support you to the best of their power. They need all the allies they can get in here.</p><p>Can do one of the following each round instead of attacking:</p><ul><li>Cast Charm Person, Hold Person, Suggestion, Levitate, Invisibility, or Detect Living.</li><li>Attach one of its four tentacles to a helpless or willing victim’s skull.</li><li>Attach the second, third or fourth tentacle to the skull of a victim with a tentacle already holding it.</li><li>Consume the brain of a victim with all four tentacles attached, healing all lost HP.</li></ul>"
    },
    {
      "title": "A Hungry Book",
      "description": "<p><strong>HD 3, HP 12, Armour as leather, Slam (+3, d4 and Information Drain), Save as Fighter 3.</strong> </p><p>Immune to poison, cold, backstab and other effects that only affect living things. Double damage from fire. </p><p>Books exist to hold information. Of course with the density of information present, sometimes this goes wrong. The books want more. They scour the data from every other book on their shelf, absorbing it into themselves, and head off in search of more.</p><p>A hungry book is only clumsily animated by the dim intelligence stirring within it. It uses its pages to crawl along the ground, sniffing out data to absorb.</p><p>A hit from the book drains data from the victim. Pick one:</p><ul><li>The party loses d4 Progress.</li><li>The victim loses 1 point of Intelligence permanently. </li><li>A scroll carried by the victim is absorbed and becomes useless.</li><li>A spell in the victim’s spellbook is absorbed and becomes useless.</li><li>Another book carried by the victim is absorbed and becomes useless.</li></ul>"
    },
    {
      "title": "2d6 Floating Brains",
      "description": "<p><strong>HD 8, HP 8, Armour as chain (forcefield), Gentle Bump (+0, 1 damage) or Special, Save as Magic-User 8.</strong></p><p>Levitates. </p><p>Blind. </p><p>Perceives the world through psychic resonances—hiding behind things won’t help, but emptying your mind of thoughts effectively makes you invisible to them.</p><p>Roll d10 twice on the list below for what else the choir can do. All will have the same powers.</p><ol><li>Project pain (all nearby Save vs Magic or take d4 damage).</li><li>Communicate telepathically.</li><li>Cause hallucinations (Save vs Magic to resist).</li><li>Teleport objects short distances.</li><li>Read memories. Erase memories read, if they want (Save vs Magic to resist erasure).</li><li>Move things telekinetically (+8 to hit, d4-d12 damage, depending on what’s used to attack).</li><li>Cause inanimate objects to crumble to dust.</li><li>Predict the immediate future. (1-in-6 chance to resist any effect through prescience).</li><li>Teleport self short distances.</li><li>Cause sleep (Save vs Magic).</li></ol><p>Remember those brains in jars? Sometimes, the isolation of a Jarred Brain has an odd effect on the mind of the interred brain. Introspection and contemplation cut off from all sensory stimulus or ability to act result in profound shifts in outlook and strange ways of thinking. </p><p>At its most dramatic extreme, such a paradigm shift in the imprisoned brain’s thinking can unlock the mind’s hidden psychoactive potential. Flexing newly-discovered psionic muscles, some of these brains break free of their glassy prison and escape. </p><p>Such brains only interact with the world through their psychic powers, and thus form a beacon to others of their kind. Soon they gather together into a sort of psionic choir, a loose flock of Floating Brains bobbing along on invisible psychokinetic currents, trailing their useless spinal columns behind them.</p><p>Needless to say, such beings are not too fond of the Librarians that imprisoned them. They’re not too fond of any Neurovores in the library either, since Floating Brains form those creatures’ main diet.</p>"
    },
    {
      "title": "1 Infernal Merchant",
      "description": "<p><strong>HD 8, HP 16, Armour as chain, Whip or Claws or Pitchfork or Flensing Knife (+8, d8 damage), Saves as Fighter 8.</strong></p><p>Half damage from any source not holy, magical, or silver. Double damage from holy sources. Immune to mind-control that doesn’t specifically target infernal beings.</p><p>A visitor from Hell. The Library contains souls, trapped and catalogued. Considering that souls are the main currency of Hell, this results in a certain degree of financial interest from the Devils.</p><p>The Infernal Merchant is here to trade souls. It might buy them or trade them for some service, or else be willing to sell souls from his stock if offered a good price. </p><p>It will seem helpful—it isn’t. Its goals are to enrich himself, to entice mortals into damning themselves, and to cause mortals to suffer. Everything it offers is a trap, its contracts carefully worded to screw the mortal signee. Small print is written on an atomic scale.</p><p>Its prices are—when you think about them—very reasonable. </p><p>Roll a d12 for its appearance. It is:</p><ol><li>Angelic.</li><li>A goat-human hybrid.</li><li>A bat-human hybrid.</li><li>A huge serpent.</li><li>Corpse-like.</li><li>Perfectly human-looking, other than tiny horns.</li><li>Perfectly human-looking, with an evil goatee and moustache.</li><li>A serpent-human hybrid.</li><li>An empty robe that oozes smoke.</li><li>A mass of chains and locks in a humanoid form.</li><li>An innocent-looking human child with a forked tongue.</li><li>A savage-looking humanoid with six arms.</li></ol><p>Roll a d12 for the Devil’s special ability:</p><ol><li>Can turn any object or being to solid gold by touching it.</li><li>Can transform into a cloud of flies.</li><li>Can transform into a harmless-looking animal.</li><li>Can mimic the appearance of the viewer’s loved ones.</li><li>Touch drains memory (d12 damage to Intelligence).</li><li>Can teleport short distances in a puff of smoke.</li><li>Can sculpt flesh like soft wax (2d6 damage if used to mutilate).</li><li>Can locate the soul of a specified individual unerringly.</li><li>Immune to fire.</li><li>Casts Charm Person when it shakes your hand.</li><li>Casts Suggestion whenever the victim answers a direct question from the Devil.</li><li>Can resurrect the dead. No need for an intact body. The dead come back… altered.</li></ol><p>The Merchant can grant each mortal a single wish. It requires payment to do so. Perhaps their soul upon death. Perhaps the murder and delivery of somebody else’s soul. Perhaps some other, seemingly innocuous task. Unless you’re incredibly precise with your wording, the wish will be perverted and made evil. You’ll get precisely what you asked for, but you’ll wish you hadn’t.</p><p>It is evil. It is smarter than the PCs.</p>"
    },
    {
      "title": "1 Escaped Fiction",
      "description": "<p><strong>HD 5, HP 15, Armour as appropriate for the character, Weapon as appropriate for the character (+5, 1D8) or else Unarmed (+0, d4), Save as Thief 5.</strong> </p><p>Once, these beings were mere characters in a story book, but now they’ve clawed their way out into the fractally-dense information cloud of the Library. They’re not truly real, but it&#39;s hard to tell—they’re very convincing.</p><p>They subconsciously crave reality. To warp the real world around their narrative so that they are part of the everyday order of things. Reality obliges. Where they pass, things alter to fit the fiction they have emerged from. You’re playing by their rules, now.</p><p>Roll a d12 to determine who you meet:</p><ol><li>Don Quixote, who tilted at windmills.</li><li>Frankenstein’s Monster, who was built from corpses.</li><li>Grendel, a monstrous inhabitant of the wilderness, who hates noise and celebration, one arm torn clean off.</li><li>Doctor Faustus, an occultist who regrets selling his soul.</li><li>Count Dracula, the monstrous vampire.</li><li>Lady Macbeth, ambitious and murderous, and of much-degraded sanity.</li><li>The Ghost of Christmas Future, who delivers dire warnings to the mean-spirited.</li><li>Bluebeard, a dashingly handsome murderer of his many wives.</li><li>Sir Lancelot, brilliant knight and enthusiastic adulterer.</li><li>Robin Hood, a charitable bandit and excellent shot.</li><li>Puck, the mischievous fairy sprite.</li><li>Jack the Giant-Slayer, young and reckless, but cunning.</li></ol><p>Vulnerabilities, quirks, powers or immunities appropriate for their character. </p><p>Attacks or other actions against them that do not fit the setting or narrative style of the work they are from fail automatically. For example, guns simply don’t exist to Sir Lancelot, so he cannot be harmed by them.</p><p>Reality shifts to accommodate the character, and behaves like the setting they’re from, not this reality. Actions intended to fit the character’s setting and narrative (such as deceiving Don Quixote into behaving chivalrously) automatically succeed. </p><p>In practice, this means that you should alter the tone and feel of your game while an escaped fiction is around. Some examples include:</p><ul><li>Blood doesn’t get spilled around characters written for children. Tone down any descriptions of gore and violence.</li><li>Conversely, for characters from more bloody and brutal tales, ratchet the violence all the way up.</li><li>Horror characters call for appropriately Gothic lighting and effects.</li><li>Technology reverts to that of the time period of the character’s setting. Items from later in history (such as guns and clockwork) simply cease to function.</li><li>In extreme examples, the PCs may be able to hear a non-diegetic soundtrack (such as trumpet fanfares for Lancelot, or low, tense strings for Lady Macbeth).</li></ul>"
    },
    {
      "title": "A Throng of 1d6 Phantoms",
      "description": "<p><strong>HD 1, HP 1, Armour as unarmoured humans, Emotional Lash (Save vs Paralysis to avoid), Save as Fighter 1.</strong></p><p>Phantoms are the spiritual remainders of a dead mortal, stripped down to their most basic form. Personality and thought eroded, Phantoms are little more than spiritual automata laden with the collected data of some mortal&#39;s lifetime. Suffice to say, such beings are ripe for exploitation by a skilled necromancer. Thus, they have become invaluable to the infrastructure of the Library, which stores them in glass tubes and uses them to power all manner of arcane machines.</p><p>Phantoms are gaseous beings, immune to all physical damage except that caused by magical items. They can pass through permeable objects, and are unaffected by fire, poison, etc.</p><p>An emotional lash is not a physical attack (indeed a phantom is incapable of affecting the physical world directly), but rather a projection of raw emotion into the mind of its victim. The effects of a phantom&#39;s emotional lash depend on its current emotional state:</p><ul><li>Contentment or Torpor: The victim has disadvantage on all rolls to act in anger or other strong emotions for one round.</li><li>Pain or Irritation: d4 damage.</li><li>Rage or Anguish: The victim must spend their next action attacking the subject of the phantom&#39;s emotions, or take d8 damage.</li><li>Fear or Despair: The victim must spend their next action hiding or cowering, or take d8 damage.</li><li>Hunger or Envy: The victim must spend their next action presenting the phantom with what it desires, or take d8 damage.</li></ul><p>A phantom&#39;s emotions are simple and direct, like those of an infant not yet able to talk or an unsophisticated animal. It understands speech only vaguely, and is able to detect emotion and tone but not precise meanings. Influencing its emotions—to calm it, or agitate it and direct it against enemies—is simple to achieve, perhaps requiring a Charisma roll if the PCs have a sensible plan. It always fails Saves to resist magical effects that manipulate its emotions.</p>"
    },
    {
      "title": "1d6 White Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Tend to the Calculations.</p><p>They can cast the following each once per turn: </p><ul><li>Invisibility</li><li>Dispel Magic</li><li>Levitate</li><li>Inflict Blindness</li><li>Inflict Deafness</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "2d6 Crawling Things",
      "description": "<p><strong>HD 1, HP 5, Armour as leather, Claw and Clutch (+1, d6), Save as Fighter 1.</strong></p><p>Improbable chimeric organisms that should not be biologically viable, and yet somehow live—twitching, shuddering, crawling. Driven by glitching muscle memory and scrambled genetic instincts. A broken democracy of mismatched anatomies. Tragically incomplete.</p><p>They want to be a whole organism. They do this by incorporating parts from those they encounter, torn off and jammed into the Crawling Thing’s amalgamated flesh.</p><p>Slow. Basically blind and deaf—but not completely, allowing a dim awareness.</p><p>If its attack hits, it latches onto the victim and begins incorporating their flesh into itself. Each round thereafter it deals damage automatically and heals by that much. To remove it, pass a Strength check or kill it.</p>"
    },
    {
      "title": "1 Patrolling Apparition",
      "description": "<p><strong>HD 3, HP 9, Armour as unarmoured humans, Chill Miasma (d8 damage, Save vs Paralysis to avoid), Save as Fighter 3.</strong></p><p>A spiritual monstrosity, dozens of souls stripped down to their barest essential nature and fused into an amalgamated weapon. Like the spiritual equivalent of weaponizing nuclear waste. </p><p>It’s barely more than a presence. A shimmer in the air, a mirage. Out of the corner of your eye, an impression of humanoid silhouettes, screaming faces, grasping hands. The smell of dust and rusty water. </p><p>It should not be. Every conscious being knows that what has been done is degenerate, instinctively finds the presence horrifying. They loathe and fear it. </p><p>The Librarians use these beings to track down thieves and spies. They don’t seem to mind their presence at all.</p><p>Apparitions are gaseous beings, immune to all physical damage except that caused by magical items. They can pass through permeable objects, and are unaffected by fire, poison, etc.</p><p>Merely being in an Apparition’s presence is painful. Each round, take 1 automatic damage. </p><p>Attacking it (in melee, at range, with spells, or in any other way) forces you to concentrate on it, also dealing 1 automatic damage. </p><p>Any damage dealt by the Apparition also permanently reduces your lowest attribute by that much.</p><p>If anybody is killed by taking damage from the Apparition, their soul is ripped from their body, twisted and mutilated—become a Shade under its total control.</p><p>If an Apparition reduces an attribute to 0, they syphon out their target’s soul and consume it. It’s gone forever—that person can never be recovered or resurrected. As a final insult, the apparition heals all damage when they consume a soul in this way.</p>"
    },
    {
      "title": "1 Eye Sentinel",
      "description": "<p><strong>HD 8, HP 8, Armour as chain (forcefield), Gentle Bump (+0, 1 damage) or Special, Saves as Magic-User 8.</strong></p><p>A single, huge, floating eyeball, levitated by psychic might alone. Sometimes, a Jarred Brain develops mighty psionic powers and escapes its jar. Sometimes, such beings are recaptured by the Librarians. This is what the Librarians do to them.</p><p>The Librarian use Eye Sentinels to monitor less frequently visited areas to ensure everything is running according to the Librarians’ schedule. </p><p>Levitates. Perceives the world through psychic resonances—hiding behind things won’t help, but emptying your mind of thoughts makes you invisible to them.</p><p>An Eye Sentinel has mighty psionic powers. Each round, it can do one of the following:</p><ul><li>Project pain (everybody must Save vs Magic or take d4 damage).</li><li>Project fatigue (target must Save vs Magic or fall asleep).</li><li>Read a mind,and edit one memory (Save vs Magic to resist).</li><li>Cast Suggestion (Save vs Magic to resist).</li><li>Summon Librarians. Either 1D6 from a particular Order, or one of each Order. The Librarians step out from behind a bookshelf next round.</li></ul>"
    },
    {
      "title": "1d6 Grey Librarians",
      "description": "<p><strong>HD 4, HP 8, Armour as unarmoured humans, Unarmed attack (+0, d2) or Magic Missile (hits automatically, d6), Saves a Magic-User 8.</strong></p><p>Those who Shepherd the Restless Dead.</p><p>They can cast the following each once per turn: </p><ul><li>Detect Undead</li><li>See Invisible</li><li>Trap the Soul</li><li>Command Undead</li><li>Reduce to Phantom</li></ul><p>These are the closest the library has to native inhabitants. They were mortal academics once, who found their way into the Library and—like a breed of fish that finds its way into a deep underground cave and slowly becomes troglodytic—remained there indefinitely. Over time, the Library has warped them into the beings they now are.</p><p>The Librarians are diminutive, standing no more than five feet tall at most, and possess a slender, almost emaciated frame. Under their voluminous robes, wide eyes peer out from pallid faces. For the most part, these beings are furtive when visitors are around, and can make themselves scarce with surprising speed and quietness when they wish to.</p><p>They do not sleep or tire.</p><p>They are totally immune to any mind-controlling effect that would turn them against their work on the Great Calculation.</p><p>They can, if hidden behind a bookshelf, step to any other bookshelf in the library as if there was no intervening space, so long as the start and end points are both unobserved—effectively allowing teleportation.</p>"
    },
    {
      "title": "1 Black Ooze",
      "description": "<p><strong>HD 1D8, HP = HD, Armour as unarmoured human, Mental Digestion (Special) saves as Fighter [level = Current HD].</strong></p><p>Like the green slime found infesting less genteel dungeons. Black Ooze is a simple life form that grows in unattended nooks and crannies. It feeds on mental energy. If it touches you, it can digest your brainwaves, causing it to grow rapidly as it absorbs and incorporates your mind. It oozes like an amoeba. It creeps under floorboards and behind wallpaper. It’s hungry.</p><p>As an Ooze, takes a maximum of 1 damage from any slashing or piercing attack. Immune to backstab due to lack of anatomy. Mindless. Can climb up walls, squeeze through gaps, etc.</p><p>Mental Digestion has a bonus to hit equal to the Ooze’s current HD and HP(an ooze with 5 HP left is HD 5 and has +5 to hit). Every time you touch it, it gets to make a free Mental Digestion attack against you.</p><p>Mental Digestion deals damage equal to d6 plus the target’s current Intelligence modifier to the target’s Intelligence score (a target with 8 Intelligence takes d6-1 Intelligence damage, because they have a –1 Intelligence modifier). The Ooze then gains as many HD as the damage dealt. </p>"
    },
    {
      "title": "A Conceptual Well",
      "description": "<p><strong>HD 1, HP 1, Armour as unarmoured human, Erase Concepts (Special, Save vs Magic to resist) and Unreal Knife (+1, d6), Saves as Magic-User 1.</strong></p><p>An intellectual absence, cosmic censorship. A space that cannot be perceived or conceptualized. Like a psychological black hole. </p><p>It cannot be perceived directly. Describe it through negation: “here isn’t something horrible in the room,” or “Nothing has rolled a 6 for its Initiative,” or “The thing that is not in front of you attacks,” or “Nothing is definitely responsible for your comrade’s death.” The players might catch on eventually, it’s just a matter of how badly it will have mutilated their PCs by then.</p><p>The PCs can target it using the same language: “I’m going to shoot nothing,” or “I’m not fleeing from anything.” They can get details about it by asking negative questions, such as “here isn’t there anything?” or “What does nothing here look like?”</p><p>If it matters, the conceptual well doesn’t look like a helpless child of around four years old. It isn’t young and innocent, and it isn’t curious about its surroundings or playful. It isn’t basically helpless as soon as the PCs actually attack it, and it doesn’t die pitifully. It also might not be violent towards the PCs. It doesn’t fundamentally fail to comprehend them, and doesn’t try to take them apart to see how they work.</p><p>It will get confusing. Good. This is an accurate simulation of what it’s like encountering something you can’t perceive and which directly assaults your ability to comprehend the external world.</p><p>Each round, for each PC that fails their save, the Conceptual Well drains their ability to comprehend some idea or concept. Roll a 1D20 for what they forget:</p><ol><li>That people can die.</li><li>Mathematics.</li><li>Money and its value.</li><li>Romance.</li><li>Violence.</li><li>Everybody related to them by blood.</li><li>Fire.</li><li>That other people have feelings, too.</li><li>Gravity.</li><li>All their superiors, and why they should be obeyed. </li><li>That animals can’t talk or reason like people can.</li><li>Everybody they hate.</li><li>That people can lie.</li><li>Pain.</li><li>How people come to exist.</li><li>Families.</li><li>Social Inequality.</li><li>Why we should obey the law, and what happens when we don’t.</li><li>Where food comes from.</li><li>That dreams aren’t real.</li></ol><p>If a PC acts in a way that suggests they are aware of an erased concept, they take d20 damage—unless they immediately retcon the action when prompted.</p>"
    }
  ]
}